{
  "schema": "magic-forge.v2",
  "raw_2014": {
    "requires_formula": true,
    "requires_spellcaster": true,
    "progress_per_day_gp": 25,
    "min_level_by_rarity": {
      "common": 3,
      "uncommon": 3,
      "rare": 6,
      "very_rare": 11,
      "legendary": 17
    },
    "creation_cost_by_rarity_gp": {
      "common": 100,
      "uncommon": 500,
      "rare": 5000,
      "very_rare": 50000,
      "legendary": 500000
    }
  },
  "xge_reference": {
    "requires_formula": true,
    "requires_tool_or_arcana": true,
    "workweek_days": 5,
    "consumables_halved": true,
    "consumable_time_multiplier": 0.5,
    "workweeks_by_rarity": {
      "common": 1,
      "uncommon": 2,
      "rare": 10,
      "very_rare": 25,
      "legendary": 50
    },
    "cost_by_rarity_gp": {
      "common": 50,
      "uncommon": 200,
      "rare": 2000,
      "very_rare": 20000,
      "legendary": 100000
    },
    "ingredient_cr_range_by_rarity": {
      "common": "1–3",
      "uncommon": "4–8",
      "rare": "9–12",
      "very_rare": "13–18",
      "legendary": "19+"
    },
    "complication_rule": "10% chance per 5 workweeks while crafting"
  },
  "homebrew_rule": {
    "days_multiplier": 0.5
  },
  "items": [
    {
      "name": "Adamantine Armor",
      "category": "Armor",
      "rarity": "uncommon",
      "attunement": false,
      "description": "This armor converts any critical hit into a normal hit",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Alchemy Jug",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "Produces acid, poison, beer, honey, mayo, oil, vinegar, fresh/salt water, wine. 1/day. Up to 2 gal/min",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ammunition, +X",
      "rarity": "varies",
      "category": "Ammunition",
      "attunement": false,
      "is_consumable": true,
      "formula_source": "DMG 2014",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "DMG 2014",
      "aliases": [
        "+1 ammo",
        "+2 ammo",
        "+3 ammo",
        "arrow +1",
        "bolt +1",
        "bullet +1"
      ],
      "notes": "Single use.",
      "variants": [
        {
          "name": "Ammunition, +1",
          "rarity": "uncommon"
        },
        {
          "name": "Ammunition, +2",
          "rarity": "rare"
        },
        {
          "name": "Ammunition, +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Amulet of Health",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "Your Constitution score becomes 19 while you wear this amulet (it has no effect if your Constitution is already 19 or higher)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Amulet of Proof against Detection and Location",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this amulet, you are hidden from divination magic; you can’t be targeted by magic scrying sensors or perceived through divination spells",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Amulet of the Planes",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "Name a known planar location and make a DC 15 Intelligence check. On a success, you cast **Plane Shift** to that destination. On a failure, you travel to a random destination instead",
      "spells": [
        "Plane Shift"
      ],
      "publication": "SRD"
    },
    {
      "name": "Animated Shield",
      "category": "Armor",
      "rarity": "very rare",
      "attunement": true,
      "description": "On command (bonus action), the shield animates and hovers, granting you its +2 AC bonus as if wielded while leaving your hands free for 1 minute or until you end it",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Apparatus of Kwalish",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": false,
      "description": "A Large mechanical contraption resembling a brass lobster. AC 20, 200 HP, it can transform to walk or swim and has 10 levers that control its movement and various functions (e.g., extend arms, shine light, open hatch). It’s airtight and can be used to explore underwater",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Armor, +X",
      "rarity": "varies",
      "category": "Armor",
      "attunement": false,
      "is_consumable": false,
      "formula_source": "DMG 2014",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "DMG 2014",
      "aliases": [
        "+1 armor",
        "+2 armor",
        "+3 armor"
      ],
      "notes": "Any armor; shields have their own entry.",
      "variants": [
        {
          "name": "Armor, +1",
          "rarity": "rare"
        },
        {
          "name": "Armor, +2",
          "rarity": "very_rare"
        },
        {
          "name": "Armor, +3",
          "rarity": "legendary"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Armor of Gleaming",
      "category": "Armor",
      "rarity": "common",
      "attunement": false,
      "description": "Armor that never gets dirty. No matter the conditions, it remains perpetually clean and shiny",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Armor of Invulnerability",
      "category": "Armor",
      "rarity": "legendary",
      "attunement": true,
      "description": "While wearing this armor, you have resistance to nonmagical damage. Additionally, you can use an action to make yourself immune to nonmagical bludgeoning, piercing, and slashing damage for 10 minutes (once per day)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Armor of Resistance",
      "category": "Armor",
      "rarity": "rare",
      "attunement": true,
      "description": "Armor that grants resistance to one type of damage (determined when the item is created)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Armor of Vulnerability",
      "category": "Armor",
      "rarity": "rare",
      "attunement": true,
      "description": "While wearing this cursed armor, you have resistance to one type of damage (bludgeoning, piercing, or slashing) but vulnerability to the other two types",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Arrow of Slaying",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": false,
      "description": "An arrow designed to slay a particular kind of creature. If it hits such a creature, the target takes an extra 6d10 damage (DC 17 Constitution save for half). Once it deals this extra damage, the arrow loses its magic",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Arrow-Catching Shield",
      "category": "Armor",
      "rarity": "rare",
      "attunement": true,
      "description": "A shield that gives a +2 bonus to AC against ranged attacks. Additionally, while wielding it, you can use your reaction to redirect an incoming ranged weapon attack to hit you instead of an ally within 5 feet",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Axe of the Dwarvish Lords",
      "category": "Weapon",
      "rarity": "artifact",
      "attunement": true,
      "description": "A +3 battleaxe that bears the legacy of dwarven rulers. It functions as multiple other magic items: as a Belt of Dwarvenkind (granting dwarven traits), a Dwarven Thrower (it returns when thrown), and a Sword of Sharpness (severs on critical hits). In addition, dwarves attuned to it gain immunity to poison, Darkvision out to 120 ft, and proficiency with artisan’s tools for brewing, smithing, and stonecutting. It has an evil intellect and a curse, and can summon an Earth Elemental or conjure stone walls",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bag of Beans",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "A bag containing 3d4 magical beans. You can dump the bag’s beans on the ground to cause an explosion (10-foot radius, 5d4 fire damage, Dex DC 15 for half). If you plant a bean in soil and water it, after 1 minute it grows into a large magical effect or creature (determined by rolling on a chaotic results table)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bag of Devouring",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "This looks like a Bag of Holding but is actually a feeding trap for an extradimensional creature. Organic material put inside has a 50% chance each turn to be destroyed as the bag attempts to devour it. If the bag is used to retrieve an item, there is a chance the creature inside tries to pull the user in (DC 15 Strength save to avoid). Once per day, it can regurgitate its contents into the Astral Plane. Tearing the bag open destroys it and ejects the creature within",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bag of Holding",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A bag with an interior extradimensional space. It can hold up to 500 pounds (volume up to 64 cubic feet) while always weighing 15 pounds. Items can be retrieved with an action. If the bag is punctured or overloaded, it ruptures (contents spill into the Astral Plane). Turning it inside out empties its contents. Placing this bag inside another extradimensional container instantly destroys both and opens a portal into the Astral Plane",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bag of Tricks",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A fuzzy cloth bag containing small fuzzy objects. You can reach in and pull out a random fuzzy object (up to 3 per day), which you can then throw. The object transforms into a creature (determined by the color of the bag and a d8 roll) that acts on your turn and obeys your commands. The creature vanishes at dawn or when it drops to 0 HP",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bead of Force",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "This black glass bead can be thrown up to 60 feet. It detonates on impact, releasing a burst of force (10-foot radius, 5d4 force damage, Dex DC 15 for half). Each creature that failed the save is encapsulated in a resilient, immovable force sphere for 1 minute. The sphere can be moved by pushing (weighs 1 lb). Once used, the bead is destroyed",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bead of Nourishment",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This simple pearl-like bead dissolves upon use and provides as much nourishment as one day’s worth of food (one full ration) to whoever swallows it",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bead of Refreshment",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This bead dissolves in liquid and transforms up to a pint of liquid into fresh, drinkable water",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Belt of Dwarvenkind",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "While wearing this belt, you gain the following benefits: your Constitution increases by 2 (to a max of 20), you have advantage on Charisma (Persuasion) checks made to interact with dwarves, you have a 50% chance each day to grow a full beard at dawn if you’re capable of growing one (or your existing beard becomes visibly thicker). Additionally, you gain darkvision out to 60 ft, advantage on saving throws against poison, and resistance to poison damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Belt of Giant Strength",
      "category": "Wondrous item",
      "rarity": "varies",
      "attunement": true,
      "description": "A belt infused with the might of giants. While attuned, your Strength score becomes a fixed number based on the kind of giant the belt is associated with. Examples: Hill Giant (Str 21, Rare), Frost/Stone (Str 23, Very Rare), Fire (Str 25, Very Rare), Cloud (Str 27, Legendary), Storm (Str 29, Legendary)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Berserker Axe",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "A +1 greataxe that grants you +1 bonus to attack and damage rolls. It is cursed with rage: while attuned, you have advantage on attack rolls with this axe, but whenever combat ends, you must make a DC 15 Wisdom save or go berserk, attacking the nearest creature (the curse makes it hard to remove once attuned)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Blackrazor",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "A sentient greatsword +3 with a dark personality. It devours the souls of those it kills: when you reduce a creature to 0 HP, Blackrazor slays it and grants you temporary hit points equal to the creature’s total HP. It also grants you haste (as the **Haste** spell) for a short duration after a kill. It can sense life, has an insatiable hunger for souls, and if you go more than a day without it consuming a soul, it may compel you to kill",
      "spells": [
        "Haste"
      ],
      "publication": "official_non_srd"
    },
    {
      "name": "Book of Exalted Deeds",
      "category": "Wondrous item",
      "rarity": "artifact",
      "attunement": true,
      "description": "A holy book filled with wisdom of goodness. Only a creature of good alignment can attune to it. Reading and studying the book over a period of time can increase your Wisdom or Charisma, and once all its magic is absorbed, it becomes blank for a century. While attuned, you have the power to create an aura of devotion that hinders fiends and undead, and you cannot be charmed or frightened. It also has other powerful holy properties",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Book of Vile Darkness",
      "category": "Wondrous item",
      "rarity": "artifact",
      "attunement": true,
      "description": "A foul tome of dark secrets. Only a creature of evil alignment can attune to it. Studying its pages can increase your Strength or Intelligence, then the text fades for a time. While attuned, you gain some dark benefits like resistance to certain damage and the ability to summon or command undead or fiends. However, it also corrupts you physically and spiritually. Destroying the book is a quest in itself",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Boots of Elvenkind",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "While wearing these soft boots, your steps make no sound, regardless of the surface you move across. You also have advantage on Dexterity (Stealth) checks that rely on moving silently",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Boots of False Tracks",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "While wearing these boots, you can choose for them to leave tracks like those of another kind of humanoid of your size, instead of your own tracks",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Boots of Levitation",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "While wearing these boots, you can cast **Levitate** on yourself at will (as an action)",
      "spells": [
        "Levitate"
      ],
      "publication": "SRD"
    },
    {
      "name": "Boots of Speed",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "While wearing these boots, you can click your heels together (bonus action) to double your walking speed and grant advantage on Dexterity saving throws for up to 10 minutes per day. During this time, opportunity attacks against you have disadvantage. This effect can be used in 1-minute increments (re-activating as long as time remains). If you move at least 10 feet in a round while the effect is active, you must spend 1 minute of its duration",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Boots of Striding and Springing",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While you wear these boots, your walking speed becomes 30 feet, unless it is higher, and your speed isn’t reduced by carrying weight or heavy armor. In addition, you can jump three times the normal distance (though not farther than your remaining movement would allow)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Boots of the Winterlands",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "These furred boots keep you comfortable in frigid environments. While wearing them, you have resistance to cold damage, you ignore difficult terrain created by ice or snow, and you can tolerate temperatures as low as -50 degrees Fahrenheit without additional protection",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bowl of Commanding Water Elementals",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "If you fill this bowl with water and speak its command, it summons a water elemental as if you had cast the **Conjure Elemental** spell. The elemental is under your control (as per the spell). The bowl can’t be used this way again until the next dawn. Spilling or dumping the water fails to summon anything",
      "spells": [
        "Conjure Elemental"
      ],
      "publication": "SRD"
    },
    {
      "name": "Bracers of Archery",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing these bracers, you have proficiency with the longbow and shortbow if you don’t already, and you gain a +2 bonus to damage rolls on ranged attacks made with such weapons",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Bracers of Defense",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "While wearing these bracers and not wearing armor or using a shield, you gain a +2 bonus to AC",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Brazier of Commanding Fire Elementals",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "If you speak the brazier’s command word and burn charcoal or wood in it for 1 minute, you summon a fire elemental as if by **Conjure Elemental**. The elemental obeys your commands (as per the spell). The brazier can’t be used this way again until the next dawn",
      "spells": [
        "Conjure Elemental"
      ],
      "publication": "SRD"
    },
    {
      "name": "Brooch of Shielding",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this brooch, you have resistance to force damage, and you have immunity to damage from the **Magic Missile** spell",
      "spells": [
        "Magic Missile"
      ],
      "publication": "SRD"
    },
    {
      "name": "Broom of Flying",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "This wooden broom can be ridden to fly. It has a flying speed of 50 feet. It can carry up to 200 pounds (but flying speed becomes 30 ft if carrying over 100 pounds). You can send the broom to travel alone to a destination you name within 1 mile as long as you speak the command word and are familiar with the route",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Candle of Invocation",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "A blessed candle that aligns with a specific deity or alignment. You can light this candle and it burns for 24 hours (or less if snuffed out). While lit, it creates a 30-foot-radius aura of divine power: if you are within the aura and share the candle’s alignment, you gain advantage on attacks, saves, and ability checks; if of the opposing alignment, you suffer disadvantage. Additionally, you can use the candle to cast **Gate**, targeting the deity or a servant of the aligned faith (which consumes the candle)",
      "spells": [
        "Gate"
      ],
      "publication": "SRD"
    },
    {
      "name": "Candle of the Deep",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A magical candle that produces flame even underwater. It can be lit normally, and the flame is not extinguished when immersed in water or in windy conditions (though it still gives off light and heat as normal)",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Cap of Water Breathing",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "This old-fashioned cap allows you to breathe normally underwater. While wearing it, you can inhale water as if it were air",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Cape of the Mountebank",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "This fine red and gold cape allows you to vanish in a puff of smoke. It has 1 charge. While wearing it, you can use an action to cast **Dimension Door** (the destination is accompanied by a puff of smoke at both departure and arrival). The cape regains its charge at dawn",
      "spells": [
        "Dimension Door"
      ],
      "publication": "SRD"
    },
    {
      "name": "Carpet of Flying",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "A magic carpet that obeys your commands. It can carry weight and fly at a specified speed based on its size (ranging from 3 ft × 5 ft to 6 ft × 9 ft). You can speak its command word to make it hover and fly. The largest carpet (6 × 9) can carry up to 600 lb at 30 ft speed (or 200 lb at 60 ft). You mentally control the carpet’s movement if you are riding it",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Cast-off Armor",
      "category": "Armor",
      "rarity": "common",
      "attunement": false,
      "description": "You can doff this armor quickly. Regardless of its type, you can remove it with only an action",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Censer of Controlling Air Elementals",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "If you burn incense in this censer for 1 minute and speak its command word, you summon an air elemental as if by **Conjure Elemental**. The elemental obeys your commands (as per the spell) and disappears after 1 hour or when reduced to 0 HP. The censer can’t be used this way again until the next dawn. (If you are underwater, the summoned elemental is a water elemental instead)",
      "spells": [
        "Conjure Elemental"
      ],
      "publication": "SRD"
    },
    {
      "name": "Charlatan's Die",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": true,
      "description": "This appears to be an ordinary six-sided die, but an attuned user can control its outcome. When you roll this die, you can choose which number it lands on",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Chime of Opening",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "A hollow metal tube that can be struck to produce a clear chime. You can use an action to strike it, targeting a locked door, lid, or gate within 120 feet. The chime issues a magical tone that automatically opens the target (as if **Knock** were cast on it). The chime can be used 10 times before it cracks and becomes inert",
      "spells": [
        "Knock"
      ],
      "publication": "SRD"
    },
    {
      "name": "Circlet of Blasting",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A crown-like headband that has 1 charge. While wearing it, you can use an action to cast **Scorching Ray** (producing three rays of fire) at +5 attack bonus. The circlet regains its charge at dawn",
      "spells": [
        "Scorching Ray"
      ],
      "publication": "SRD"
    },
    {
      "name": "Cloak of Arachnida",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "A black silk cloak embroidered with spider webs. While wearing it, you gain the following benefits: resistance to poison damage, climbing speed equal to walking speed, the ability to move on walls and ceilings without needing to make an ability check, and the ability to cast **Web** (save DC 13) as an action (recharges at dawn). Additionally, you can’t be caught in webs of any sort and can move through them as if they were difficult terrain",
      "spells": [
        "Web"
      ],
      "publication": "SRD"
    },
    {
      "name": "Cloak of Billowing",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A fashionable cape that you can command (as a bonus action) to billow dramatically behind you, even when there is no wind",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Cloak of Displacement",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "This cloak is made from the hide of a displacer beast. While wearing it, creatures have disadvantage on attack rolls against you. If you take damage, this property ceases to function until the start of your next turn (it also ceases while you are incapacitated or restrained)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Cloak of Elvenkind",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this hooded cloak with its hood up, Wisdom (Perception) checks made to see you have disadvantage, and Dexterity (Stealth) checks you make to hide have advantage. Pulling the hood up or down requires an action",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Cloak of Invisibility",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "This cloak can be pulled over your body to make you invisible. You can use an action to become invisible while wearing it. The effect lasts for a total of 2 hours, which need not be continuous (each use consumes at least 1 minute of duration). The invisibility ends early if you attack or cast a spell. Reclaiming spent time requires waiting until the next dawn (when the cloak regains 2 hours of invisibility per day)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Cloak of Many Fashions",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This cloak can magically change its color, style, and overall appearance on command (no action required). It doesn’t change its fundamental shape or size, but it can look like any kind of cloak or cape you desire",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Cloak of Protection",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this cloak, you gain a +1 bonus to AC and saving throws",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Cloak of the Bat",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "This dark cloak grants you bat-like abilities. While wearing it in dim light or darkness, you can grip it to fly at a speed of 40 ft. If you are in an area of dim light or darkness, you can also use an action to polymorph into a bat (while retaining your Intelligence, Wisdom, Charisma). If you lose the cloak or it’s exposed to sunlight, you revert to normal form",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Cloak of the Manta Ray",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "While wearing this cloak with its hood up, you can breathe underwater, and you have a swimming speed of 60 feet",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Clockwork Amulet",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This copper amulet contains clockwork gears. When you make an attack roll while wearing it, you can forego the roll to instead take a 10 on the d20 (once per dawn). Essentially, you can replace one attack roll with an automatic 10. It resets at dawn",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Clothes of Mending",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This set of ordinary-looking travel clothes magically mends and cleans itself. Any tears, rips, or dirt marks disappear from it daily, ensuring it always looks fresh",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Crystal Ball",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "A traditional crystal scrying orb. While attuned, you can cast the **Scrying** spell (Wisdom save DC 17) with it. Some versions of this item (legendary variants) have additional properties, such as allowing **Telepathy** or casting **Detect Thoughts** through the scrying sensor",
      "spells": [
        "Scrying"
      ],
      "publication": "SRD"
    },
    {
      "name": "Cube of Force",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "A small golden cube with inset gemstones. It has 36 charges. You can use an action to press one of its faces to generate an invisible barrier (a 15-foot cube around you) that moves with you. Different faces allow different things to pass through the barrier (for example, one face allows only gases, wind, and ethereal creatures to pass, blocking everything else). Each minute of use or each round certain things hit the barrier expends charges. When charges run out, the cube deactivates. It regains 1d20+6 charges daily at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Cubic Gate",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": false,
      "description": "A 3-inch cube with each face engraved with a distinct symbol. Each face corresponds to a different plane of existence. You can use an action to press one face to cast **Gate**, opening a portal to the plane indicated. Alternatively, you can use an action to press one face twice to transport yourself and willing nearby creatures to the linked plane. The cube’s portal can remain open or active for a total of 1 minute per day, divided as you choose",
      "spells": [
        "Gate"
      ],
      "publication": "SRD"
    },
    {
      "name": "Daern's Instant Fortress",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "A small metal cube that can be placed on the ground and activated (action). It rapidly grows into a sturdy 20-foot tall fortress tower (square base 20 ft on a side). The tower has arrow slits, a door that opens only on your command, and battlements. It’s made of adamantine (AC 20, 100 HP per 10-ft section). You can use an action to speak a command word to shrink the fortress back into a cube (provided no creatures are inside). If reduced to 0 HP, the fortress breaks and can’t be used again",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Dagger of Venom",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": false,
      "description": "A magic dagger +1. Once per day, you can use an action to coat the blade in poison. The next creature you hit with it must make a DC 15 Constitution save or take an extra 2d10 poison damage and become poisoned for 1 minute",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dancing Sword",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "You can use a bonus action to toss this magic sword into the air and command it to fight on its own. It hovers and can attack a creature of your choice within 30 feet of you (attack + your modifier). It remains animated for up to 4 rounds, then falls to the ground. This property can be used once per short or long rest",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dark Shard Amulet",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": true,
      "description": "A bleak crystal amulet used by warlocks. If you are attuned and a warlock, you can try to cast a cantrip that you don’t know. Make an Intelligence (Arcana) check (DC 10); on a success, you cast the chosen warlock cantrip. On a failure, it fizzles and you take psychic feedback (d4 damage per cantrip level). This can be attempted once per long rest",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Decanter of Endless Water",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A stoppered flask that sloshes when shaken, as if filled with water. It has 3 command words: “Stream” (produces 1 gallon of fresh water), “Fountain” (produces 5 gallons), and “Geyser” (produces 30 gallons that gush forth in a 30-foot long, 1-foot wide stream). The geyser can be directed at a target (it can knock them prone and deal a small amount of bludgeoning damage, DC 13 Strength save to resist). Each use is an action, and the decanter can be used as often as desired",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Deck of Illusions",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A deck of 34 illustrated cards. You can use an action to draw a card and throw it to the ground. An illusion of a creature springs up (as determined by the card drawn) as if by **Major Image**. The illusion lasts until dispelled or attacked. Once a card is used, it vanishes. The deck becomes empty when all cards are drawn",
      "spells": [
        "Major Image"
      ],
      "publication": "SRD"
    },
    {
      "name": "Deck of Many Things",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": false,
      "description": "An infamous set of 13 or 22 tarot-like cards bearing powerful magic. Drawing a card (declared beforehand) causes a supernatural effect—ranging from tremendous fortune (gaining levels or magic items) to disaster (loss of soul, enmity of an outsider, etc.):contentReference[oaicite:5]{index=5}. Once drawn, a card’s effect occurs and the card fades. The deck is highly unpredictable and campaign-altering",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Defender",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "A +3 magic sword (usually a longsword) that allows you to transfer some or all of its bonus to your AC. When you attack with it, you can choose to reduce the attack bonus (up to the +3) and gain an equivalent bonus to your Armor Class until your next turn. Essentially, you can trade offense for defense each swing",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Demon Armor",
      "category": "Armor",
      "rarity": "very rare",
      "attunement": true,
      "description": "Cursed spiked plate armor (AC 18) that grants you a +1 bonus to AC and the ability to make unarmed strikes that deal 1d8+1 slashing damage. However, once donned, you cannot remove this armor unless a **Remove Curse** is cast on you. While wearing it, you have disadvantage on attack rolls against demons, and they have advantage on attack rolls against you",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dimensional Shackles",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "These iron shackles adjust to fit any Small or larger creature. A creature bound by them is restrained and cannot use any method of extradimensional movement (such as teleportation or travel to other planes). They don’t prevent the creature from passing through a **Gate** or similar portal. You can use an action to remove the shackles, and they have 15 hit points (Strength DC 30 to break)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dragon Scale Mail",
      "category": "Armor",
      "rarity": "very rare",
      "attunement": true,
      "description": "Scale mail made from the scales of a particular kind of dragon. It grants a +1 bonus to AC, advantage on saving throws against the Frightful Presence and breath weapons of dragons, and resistance to one damage type corresponding to the dragon (e.g., fire for red dragon scales). Additionally, you can focus your senses to detect the distance and direction to the closest dragon of the same type as the armor within 30 miles (once per day)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dragon Slayer",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": false,
      "description": "Any sword (usually a longsword or greatsword) that is especially deadly to dragons. It is a +1 magic weapon. When you hit a dragon with it, the dragon takes an extra 3d6 slashing damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dread Helm",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This fearsome steel helm makes your eyes glow red while you wear it. It’s a cosmetic effect meant to intimidate; it gives you a menacing appearance",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Driftglobe",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A small glass sphere that glows. If you are within 60 feet of it, you can speak a command word to make it float and radiate either the **Light** spell or the **Daylight** spell. Once **Daylight** is used, it can’t be used again until the next dawn. If not being carried, the driftglobe hovers 5 feet off the ground and follows you at a distance of up to 60 ft",
      "spells": [
        "Light",
        "Daylight"
      ],
      "publication": "SRD"
    },
    {
      "name": "Dust of Disappearance",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A pinch of fine dust in a stoppered pouch. You can use an action to throw the dust in the air. You and all creatures and objects within 10 feet become invisible for 2d4 minutes. The effect ends early on a creature that attacks or casts a spell",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dust of Dryness",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A small packet of gray dust. You can sprinkle a pinch of it into a 15-foot cube of water, converting the water into a marble-sized pellet (the pellet retains the water’s weight). Alternatively, you can throw the pellet at a hard surface to break it and release the water. One pinch can absorb up to 15 cubic feet of water. The packet contains enough dust for multiple uses (typically 1d6+4 pinches total)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dust of Sneezing and Choking",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "Appears to be Dust of Disappearance. If thrown in the air, all creatures that breathe within 30 feet must make a DC 15 Constitution save. On a failure, a creature becomes unable to breathe, begins sneezing uncontrollably, and is incapacitated. While affected, a creature takes 1d4 points of damage at the start of each turn. It can repeat the save at end of turns. On a success, a creature is only incapacitated for a round. This dust is a trap for the unwary user",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dwarven Plate",
      "category": "Armor",
      "rarity": "very rare",
      "attunement": false,
      "description": "Plate armor (AC 18) made for dwarf lords. It grants a +2 bonus to AC. Additionally, while wearing it, if an effect moves you against your will along the ground, you can use your reaction to reduce that distance moved by up to 10 feet",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dwarven Thrower",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "A legendary warhammer +3 (requires attunement by a dwarf ). It gains an extra +1d8 damage when thrown (or +2d8 if the target is a giant) and immediately flies back to your hand after a thrown attack",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ear Horn of Hearing",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "An antique hearing horn that, when used, negates the effects of the deafened condition for the user. Essentially, it allows a deafened creature to hear normally while the horn is used",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Efreeti Bottle",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "A stoppered brass bottle etched with images of flame. You can use an action to remove the stopper and command the efreeti inside. There’s a 10% chance the efreeti is hostile and escapes, a 10% chance it grants three wishes (then disappears forever), and an 80% chance it serves you for up to an hour (then returns to the bottle). Once the bottle’s magic is expended (like after the wishes or service), it becomes a nonmagical item",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Efreeti Chain",
      "category": "Armor",
      "rarity": "legendary",
      "attunement": true,
      "description": "Magical chain mail (usually a fiery aesthetic) that provides a +3 bonus to AC. While wearing it, you have immunity to fire damage and can speak the Primordial language (the tongue of elemental creatures)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Elemental Gem",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A gem of a specific color (blue for water, red for fire, yellow for air, green for earth). You can use an action to crush the gem, which summons an elemental (of the corresponding type) as if you had cast **Conjure Elemental**. The elemental is friendly to you and remains for up to 1 hour or until slain",
      "spells": [
        "Conjure Elemental"
      ],
      "publication": "SRD"
    },
    {
      "name": "Elixir of Health",
      "category": "Potion",
      "rarity": "rare",
      "attunement": false,
      "description": "A vial of clear red liquid. When you drink this potion, it cures any disease afflicting you, and it removes the blinded, deafened, paralyzed, and poisoned conditions",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Elven Chain",
      "category": "Armor",
      "rarity": "rare",
      "attunement": false,
      "description": "Mithril chain shirt that is so finely crafted, it can be worn even if you lack proficiency in medium armor. It grants a +1 bonus to AC, and you are considered proficient with it even if you normally wouldn’t be",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Enduring Spellbook",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A wizard’s spellbook specially treated to be resistant to damage. It cannot be damaged by fire or water, and it never deteriorates with age",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ersatz Eye",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": true,
      "description": "A polished artificial eye that can replace a lost eye. While the prosthetic eye is in place and attuned, it functions just like a normal eye (restoring sight if you lost your real eye). The magic of the eye keeps it attached and moving normally",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Eversmoking Bottle",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A sealed brass bottle. When you use an action to remove the stopper, a cloud of thick smoke pours out (heavily obscuring a 60-foot radius area). The smoke leaks out and expands until you use an action to stopper the bottle. The smoke persists and can only be dispersed by strong wind. Stopping the bottle disperses the smoke after 10 minutes",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Eye and Hand of Vecna",
      "category": "Wondrous item",
      "rarity": "artifact",
      "attunement": true,
      "description": "The mummified hand and eye of the arch-lich Vecna. To attune, you must graft the eye into an empty socket and/or replace your hand with the artifact. Once attuned, you gain tremendous necromantic power (spells and special abilities), but at a terrible cost—the artifacts are profoundly evil and begin to corrupt you. The Hand gives strength and destructive touch powers; the Eye grants powerful vision and spell abilities. Both together make you an almost unparalleled wielder of death magic. Removing them costs your life unless special rituals are performed",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Eyes of Charming",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "A pair of enchanted glasses or lenses. They have 3 charges. While wearing them, you can expend 1 charge as an action to cast **Charm Person** (save DC 13) on a creature you can see. They regain 1d3 expended charges daily at dawn",
      "spells": [
        "Charm Person"
      ],
      "publication": "SRD"
    },
    {
      "name": "Eyes of Minute Seeing",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "These crystal lenses fit over the eyes. When worn, they grant advantage on Intelligence (Investigation) checks that rely on sight and are made to observe fine details of objects or surfaces within 1 foot",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Eyes of the Eagle",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "These ornate goggles sharpen your eyesight. While wearing them, you have advantage on Wisdom (Perception) checks that rely on sight. In conditions of clear visibility, you can make out details of even extremely distant objects as though looking through a telescope",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Figurine of Wondrous Power",
      "category": "Wondrous item",
      "rarity": "varies",
      "attunement": false,
      "description": "These are statuettes of animals carved from various materials. When you speak the command word, the figurine becomes a living creature of its kind, serving you faithfully. Each figurine type has a specific rarity and properties (e.g., a **Bronze Griffon** figurine that can become a griffon for up to 6 hours, usable twice per week). After a certain duration or if it drops to 0 HP, it reverts to figurine form",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Flame Tongue",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "A magic sword (often a longsword or rapier) that can erupt in flames. You can use a bonus action to speak its command word, causing flames to engulf the blade. The flames shed bright light (40 ft) and dim light (another 40 ft) and cause the sword to deal an extra 2d6 fire damage on a hit. The flames remain until you extinguish them (no action required)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Folding Boat",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "This object appears to be a small wooden box. It can be commanded to unfold into a boat. The first command word causes it to unfold into a 10-ft long rowboat (4 oars, anchor, etc.). The second command word creates a larger 24-ft long vessel with a mast and sail. A third command word causes it to fold back into a box. Transforming takes 1 round",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Frost Brand",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "A magical sword (usually longsword) imbued with cold. It is a +1 weapon that deals an extra 1d6 cold damage on a hit. While you hold it, you have resistance to fire damage. In freezing temperatures, the blade sheds bright light (10 ft) and dim light (another 10 ft). Additionally, when you draw this sword, you can extinguish all nonmagical flames within 30 feet of you (no action required). This effect can’t be used again until the next dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Gauntlets of Ogre Power",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing these heavy gauntlets, your Strength score becomes 19, unless it is already 19 or higher",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Gem of Brightness",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A prism that holds 50 charges of light magic. You can use an action to speak a command word and expend charges to produce one of three effects: **(1)** Make the gem shed bright light in a 30-ft radius (and dim light 30 ft beyond) for 10 minutes (no charge); **(2)** Illuminate a brilliant beam at one creature (within 60 ft) forcing a DC 15 Constitution save or be blinded for 1 minute (expends 1 charge); **(3)** Create a blinding flare in a 30-ft cone (expends 5 charges) forcing the same save or blind multiple targets. The gem regains 1d4+1 charges at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Gem of Seeing",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "A sapphire lens or gem that has 3 charges. While holding it to your eye, you can expend 1 charge to gain **Truesight** out to 120 feet for 10 minutes. The gem regains 1d3 expended charges each day at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Giant Slayer",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": false,
      "description": "A magic weapon (usually a sword or axe) +1. When you hit a giant (any creature with the Giant type) with it, the giant takes an extra 2d6 damage. Also, the giant must succeed on a DC 15 Strength save or fall prone",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Glamoured Studded Leather",
      "category": "Armor",
      "rarity": "rare",
      "attunement": false,
      "description": "Studded leather armor +1 that can magically change its appearance. You can use a bonus action to cause the armor to look like normal clothing or some other kind of armor. Regardless of appearance, it retains its protective properties",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Gloves of Missile Snaring",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing these gloves, when a ranged weapon attack hits you, you can use your reaction to reduce the damage by 1d10 + your Dexterity modifier. If you reduce the damage to 0, you catch the projectile (if it’s small enough to hold in one hand and you have a hand free)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Gloves of Swimming and Climbing",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing these webbed, friction-textured gloves, you have a swimming speed and a climbing speed equal to your normal movement speed, and you have advantage on Strength (Athletics) checks made to swim or climb",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Gloves of Thievery",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "These gloves are invisible when worn. While wearing them, you gain a +5 bonus to Dexterity (Sleight of Hand) checks and Dexterity checks made to pick locks",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Goggles of Night",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "While wearing these dark lenses, you have darkvision out to a range of 60 feet. If you already have darkvision, wearing the goggles increases its range by 60 feet",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Hammer of Thunderbolts",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "A magic warhammer +1 that can be attuned only by someone with Gauntlets of Ogre Power and a Belt of Giant Strength. When attuned under those conditions, it becomes a +3 weapon. It deals an extra 2d6 thunder damage on a hit. If thrown (range 20/60), it emits a thunderclap audible out to 300 feet and the target (if a creature) must succeed on a DC 17 Constitution save or be stunned until the end of your next turn. It returns to your hand when thrown",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Hat of Disguise",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "This hat allows you to cast **Disguise Self** at will (no components required)",
      "spells": [
        "Disguise Self"
      ],
      "publication": "SRD"
    },
    {
      "name": "Hat of Vermin",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This old cloth hat has 3 charges. While wearing it, you can use an action to expend 1 charge and pull out a harmless furry creature (a bat, a frog, or a rat – determined at random). The summoned creature is not under your control, but it is ordinary and nonhostile. It vanishes at the next dawn or when it drops to 0 HP. The hat regains all charges at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Hat of Wizardry",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": true,
      "description": "A pointy wizard’s hat stitched with stars and moons. If you are a wizard wearing it, you can try to cast a wizard cantrip that you don’t know. You must make a DC 10 Intelligence (Arcana) check. On a success, you cast the cantrip; on a failure, the cantrip fails (but the use of this property isn’t expended). This can be attempted once per long rest",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Headband of Intellect",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this headband, your Intelligence score becomes 19, unless it is already 19 or higher",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Helm of Brilliance",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "A helm decorated with 10 diamonds, 20 rubies, 30 fire opals, and 40 opals. It has many magical properties: it glows in the presence of undead or fiends; you have resistance to fire damage; you can use an action to expend some of the embedded gems to produce spell effects (gems are consumed): diamonds cast **Prismatic Spray**, rubies cast **Wall of Fire**, fire opals cast **Fireball**, opals cast **Daylight**. If you take significant fire damage while wearing it, some gems may detonate. The helm loses magic when all gems are gone",
      "spells": [
        "Prismatic Spray",
        "Wall of Fire",
        "Fireball",
        "Daylight"
      ],
      "publication": "SRD"
    },
    {
      "name": "Helm of Comprehending Languages",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "While wearing this helm, you can use an action to cast **Comprehend Languages** at will (on yourself only)",
      "spells": [
        "Comprehend Languages"
      ],
      "publication": "SRD"
    },
    {
      "name": "Helm of Telepathy",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this brass helm, you can use an action to cast **Detect Thoughts** (save DC 13). As long as you maintain concentration on Detect Thoughts, you can use a bonus action to cast **Suggestion** (DC 13) on a creature you are reading (the target automatically fails its save against Suggestion if the Detect Thoughts spell is still active and you’ve probed its mind). These properties reset at dawn",
      "spells": [
        "Detect Thoughts",
        "Suggestion"
      ],
      "publication": "SRD"
    },
    {
      "name": "Helm of Teleportation",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "This helm has 3 charges. While wearing it, you can use an action to expend 1 charge and cast **Teleport** (transporting yourself and willing creatures as the spell). The helm regains 1d3 charges each day at dawn",
      "spells": [
        "Teleport"
      ],
      "publication": "SRD"
    },
    {
      "name": "Heward's Handy Haversack",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "A small backpack with multiple extradimensional pockets. Each of the two side pouches can hold up to 20 pounds of items (space of 2 cubic feet each) and the main pouch can hold up to 80 pounds (8 cubic feet). The haversack always weighs only 5 pounds. When you reach into it for a specific item, that item is always magically on top. If the haversack is overloaded or punctured, it ruptures and is destroyed, scattering its contents in the Astral Plane",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Heward's Handy Spice Pouch",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A magical spice pouch with 10 charges. As an action, you can spend 1 charge to pull out a pinch of a nonmagical seasoning (salt, pepper, garlic, etc.) of your choice. The pouch regains 1d6+4 charges each dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Holy Avenger",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "A revered +3 sword (typically a greatsword or longsword) that requires attunement by a Paladin. When you hit a fiend or undead with it, that creature takes an extra 2d10 radiant damage. Additionally, while you hold the sword, you and all allies within 10 ft have advantage on saving throws against spells and magical effects. If you are attuned and have at least one spell slot, the radius of this aura increases to 30 ft",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Horn of Blasting",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "You can use an action to blow this horn, creating a 30-foot cone of deafening sound. Each creature in the cone must make a DC 15 Constitution save or take 5d6 thunder damage and be deafened for 1 minute (half damage and not deafened on a success). Creatures made of inorganic material (stone, crystal, metal) have disadvantage on the save. Each use of the horn has a 20% chance of causing it to explode (dealing 10d6 fire damage to the blower)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Horn of Silent Alarm",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This brass horn has 4 charges. You can use an action to spend 1 charge and blow the horn. Only one creature of your choice (who you can see, within 600 feet) hears the horn’s blare—no other creature hears the sound. The horn regains 1d4 charges daily at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Horn of Valhalla",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "A silver or brass war horn (rarity varies by material). You can use an action to blow the horn. A number of warrior spirits (berserkers) appear to aid you, based on the horn’s type: e.g., the Silver horn summons 2d4+2 berserkers. Once you use the horn, it can’t be used again for 7 days. Only a character of proficient with all martial weapons can use the horn properly (others who attempt to use it might take psychic damage)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Horseshoes of a Zephyr",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "These four iron horseshoes attach themselves to the hooves of a horse or similar mount. While attached, the mount can move normally while floating 4 inches above the ground. This effect means the mount ignores difficult terrain, can walk on water or fragile surfaces without falling, and leaves no tracks",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Horseshoes of Speed",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "These four magical horseshoes clamp onto a horse or similar creature’s hooves. The creature’s walking speed increases by 30 feet",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Immovable Rod",
      "category": "Rod",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A flat iron rod with a button. When you press the button (action), the rod fixes itself in space. It does not move, even defying gravity. It can hold up to 8,000 pounds of weight. A DC 30 Strength check is needed to move it one inch. Pressing the button again releases it",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Instrument of Illusions",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": true,
      "description": "A musical instrument (such as a lute or flute) that creates minor illusions. While attuned and playing this instrument, you can create harmless, illusory visual effects that fit with the music (e.g., dancing lights, spectral dancers). The illusions have no sound and last only while you play",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Instrument of Scribing",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": true,
      "description": "A magical pen or other writing instrument with 3 charges. While attuned, you can use an action to expend 1 charge and cause the instrument to write a magical message of up to 25 words on a surface. The message remains for 24 hours, then fades. The instrument regains all charges daily",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Instrument of the Bards",
      "category": "Wondrous item",
      "rarity": "varies",
      "attunement": true,
      "description": "A family of magical musical instruments (like the Fochlucan Bandore, Canaith Mandolin, etc.), each named and of ascending rarity. All require attunement by a Bard. Each instrument grants the ability to cast a set of spells (e.g., **Fly**, **Invisibility**, **Levitate**, **Protection from Evil and Good**, etc. depending on the instrument) a limited number of times per day. It also grants advantage on musical performance checks. Each specific instrument has its own list of spells and properties",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ioun Stone",
      "category": "Wondrous item",
      "rarity": "varies",
      "attunement": true,
      "description": "These are magical stones (of varying colors and shapes) that float and orbit around your head once attuned. Each stone grants a different benefit while orbiting you. Examples: Ioun Stone of Leadership (clear spindle) increases one ability score to 19; Ioun Stone of Regeneration (violet) lets you regain HP gradually; etc. Each stone is a rare to very rare item depending on its benefit",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Iron Bands of Bilarro",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "A rusty iron sphere that can be thrown at a creature. When it hits, it bursts into iron bands that wrap the target. The creature must succeed on a DC 20 Strength saving throw or be restrained. While restrained, the creature can take an action to attempt a DC 20 Strength check to break free (destroying the bands on a success). Otherwise, the bands can be attacked (AC 20, 20 HP, immune to all but bludgeoning damage). Once used (successfully restraining), the bands can only be reset by speaking a command word (and only if the creature is no longer restrained by them)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Iron Flask",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": false,
      "description": "A metal flask sealed with a brass stopper and arcane sigils. The flask can trap creatures. As an action, you can speak a command word targeting a creature you can see within 60 ft. The creature must succeed on a DC 17 Wisdom save or be trapped in the flask (if it’s native to a different plane of existence than the one you’re on). Only one creature can be trapped at a time. You can release the creature by removing the stopper (it is under no obligation to serve you). The flask can only imprison a creature once before losing its magic",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Javelin of Lightning",
      "category": "Weapon",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A magic javelin that can transform into a bolt of lightning. When you hurl it and speak its command word, it turns into a 5-ft wide, 120-ft long line of lightning. Each creature in the line (except you and the target) must make a DC 13 Dexterity save, taking 4d6 lightning damage on a failure (half on success). The lightning bolt turns back into a javelin when it reaches the target, then you make a normal attack against the target (which takes damage from the javelin plus 4d6 lightning). This property can be used once per dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Keoghtom's Ointment",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A small jar containing 1d4+1 doses of a thick mixture. One dose, applied to the skin or swallowed, cures you of any disease, removes the poisoned condition, and heals 2d8+2 hit points",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Lantern of Revealing",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A hooded lantern that burns oil normally. While lit, it illuminates invisible creatures and objects as if they were visible. Any invisible creature in the bright light of the lantern becomes visible",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Lock of Trickery",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A padlock that imposes mischief on those trying to pick it. The DC to pick this lock with thieves’ tools is 15. If the attempt fails by 5 or more, the lock emits a loud *laughing* noise. Regardless, any attempt to pick the lock is made at disadvantage due to its tricky mechanisms",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Luck Blade",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "A +1 sword (often a shortsword) that has 1d4-1 charges of **Wish** stored in it. It regains 1 expended Wish charge each year. Also, while attuned, you have **Luck**: if you make an attack roll, ability check, or save, you can reroll it and choose which result to use (this property resets at dawn). After using **Wish** via the blade, that charge is gone until it regains one naturally",
      "spells": [
        "Wish"
      ],
      "publication": "SRD"
    },
    {
      "name": "Mace of Disruption",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "A holy mace +1. When you hit a fiend or undead with it, that creature takes an extra 2d6 radiant damage. If the target has 25 HP or fewer after taking this damage, it must make a DC 15 Wisdom save or be instantly destroyed (if undead or a fiend) or frightened of you (if it has more HP). The mace also glows with bright light (20 ft) whenever an undead or fiend is within 120 feet of you",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Mace of Smiting",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": false,
      "description": "A magic mace +1. It becomes +3 when used to attack constructs. On a critical hit against a construct, the hit deals an extra 7 bludgeoning damage (or 14 extra if the weapon is +3 against that target), and there is a 50% chance the construct is instantly destroyed if it has 25 HP or fewer",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Mace of Terror",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "This magic mace has 3 charges. While holding it, you can use an action to expend 1 charge to release a wave of terror. Each creature of your choice within 30 feet must make a DC 15 Wisdom save or be frightened of you for 1 minute. Frightened targets can repeat the save at end of turns to end the effect. The mace regains 1d3 charges daily at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Mantle of Spell Resistance",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "A protective cloak that shimmers with arcane energy. While wearing this mantle, you have advantage on saving throws against spells and other magical effects",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Manual of Bodily Health",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "One of a set of magical tomes. If you spend 48 hours over a period of 6 days or fewer studying this book, your Constitution score increases by 2, and your maximum for that score increases by 2. The manual then loses its magic, and regains it in a century",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Manual of Gainful Exercise",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "Another magical tome. Studying it for 48 hours over no more than 6 days increases your Strength score by 2, and your maximum for Strength increases by 2. The manual becomes nonmagical afterward until a hundred years pass",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Manual of Golems",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "A thick tome detailing the creation of a golem. The manual specifies a particular type of golem (clay, flesh, iron, or stone). To use it, you must spend the specified time and gold to construct the golem’s body and cast spells as the manual instructs. If you succeed, the manual is consumed and a golem comes to life under your control. If you fail or cease construction, the manual isn’t consumed (but any gold spent is wasted). Each manual can be used only once",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Manual of Quickness of Action",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "Another tome of understanding. Studying it for 48 hours over ≤6 days increases your Dexterity score by 2 (and your Dex maximum by 2). The manual then loses its magic for 100 years",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Mariner's Armor",
      "category": "Armor",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A set of armor (any type) that is specially treated for the sea. While wearing it, you have a swimming speed equal to your walking speed, and if you sink below 0 HP while in water, the armor automatically carries you to the surface",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Medallion of Thoughts",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "This amulet has 3 charges. While wearing it, you can expend 1 charge to cast **Detect Thoughts** (save DC 13). It regains 1d3 charges daily",
      "spells": [
        "Detect Thoughts"
      ],
      "publication": "SRD"
    },
    {
      "name": "Mirror of Life Trapping",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "A 4-ft tall mirror with an ornate frame. It contains 12 extra-dimensional cells. You can use an action to speak a command word and activate the mirror for 1 minute. During that time, any time a creature sees its reflection in the mirror (within 30 ft), it must succeed on a DC 15 Charisma save or be trapped in one of the mirror’s cells. The mirror can hold up to 12 creatures. Another command word can free a specific trapped creature. Breaking the mirror frees all. Each prisoner doesn’t age and doesn’t need to eat or drink while trapped",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Mithral Armor",
      "category": "Armor",
      "rarity": "uncommon",
      "attunement": false,
      "description": "Any Medium or Heavy armor (except hide) crafted from mithral, a light and flexible metal. If the armor normally imposes disadvantage on Stealth or has a Strength requirement, a mithral version does not. For instance, mithral plate has no Str requirement and doesn’t impose Stealth disadvantage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Moon-touched Sword",
      "category": "Weapon",
      "rarity": "common",
      "attunement": false,
      "description": "A sword that glows under moonlight. It’s a common magic sword with no bonus, but when drawn, it sheds bright moonlight in a 15-foot radius and dim light for another 15 feet",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Moonblade",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "An ancient elven magical longsword, unique in each incarnation. It starts as a +1 longsword but can gain additional powers and +1 bonuses for each “rune” it awakens (linked to each attunement by an elf in its history). Typically, a fully awakened moonblade might be +3 and have several special properties (like detecting evil, shooting beams of light, etc.). It is sentient and only allows attunement by elves or those it deems worthy. It also protects elvenkind (for example, some moonblades grant a defensive aura to elf allies)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Mystery Key",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "An old key of unknown origin. It has a 5% chance of unlocking any lock (one use). When it successfully opens a lock, or when it fails to open anything, the key disappears in a puff of smoke",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Necklace of Adaptation",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this necklace, you can breathe normally in any environment (including toxic gas or underwater), and you have advantage on saving throws against harmful gases and vapors (such as cloudkill or inhaled poisons)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Necklace of Fireballs",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "A necklace strung with golden beads. It has 1d6+3 beads. You can use an action to detach a bead and throw it up to 60 feet. It detonates as a 3rd-level **Fireball** spell (save DC 15). You can hurl multiple beads at once to increase the spell’s level for each additional bead. Once all beads are used, the necklace becomes nonmagical",
      "spells": [
        "Fireball"
      ],
      "publication": "SRD"
    },
    {
      "name": "Necklace of Prayer Beads",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "A necklace with 1d4+2 magical beads, each corresponding to a spell. Six types of beads exist (Bless, Curing, Favor, Smiting, Summons, Wind Walking). If you’re a spellcaster, you can use an action to touch a bead and cast its spell (spell save DC 15) without expending a spell slot. Once used, a bead’s magic is lost until the next dawn (for beads of Bless, Curing, or Wind Walking) or permanently for others",
      "spells": [
        "Bless",
        "Cure Wounds",
        "Greater Restoration",
        "Branding Smite",
        "Planar Ally",
        "Wind Walk"
      ],
      "publication": "SRD"
    },
    {
      "name": "Nine Lives Stealer",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "A +2 magic sword (usually a longsword) with a dark enchantment. It has 1d8+1 charges. When you score a critical hit against a creature with fewer than 100 HP, it must make a DC 15 Constitution save. On a failure, it is instantly slain as the sword steals its life (expending one charge). The sword loses its magic when all charges are spent",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Nolzur's Marvelous Pigments",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "A set of vibrant paints. You can use them to paint an object or terrain feature (up to 100 square feet). After 10 minutes, the painting becomes a real, nonmagical object of that form. For example, you can paint a door on a wall, and it becomes a real door. You can’t create magic items, and living creatures created are only realistic illusions. There is a limited amount of paint, enough to cover 1,000 square feet in total",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Oathbow",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "An elegant white longbow. When you nock an arrow and whisper “Swift defeat to my enemies” in Elvish, you designate a creature as this bow’s *sworn enemy*. Against that target, you have advantage on attack rolls, and you deal an extra 3d6 piercing damage on a hit. You cannot use this property on another target until your current sworn enemy dies or 7 days pass. While your sworn enemy lives, you have disadvantage with all other weapons",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Oil of Etherealness",
      "category": "Potion",
      "rarity": "rare",
      "attunement": false,
      "description": "A thick silvery oil. You can apply it to yourself over 10 minutes. After application, you gain the effect of the **Etherealness** spell (for up to 1 hour). This allows you to move through objects and access the Ethereal Plane temporarily",
      "spells": [
        "Etherealness"
      ],
      "publication": "SRD"
    },
    {
      "name": "Oil of Sharpness",
      "category": "Potion",
      "rarity": "very rare",
      "attunement": false,
      "description": "A glittering oil that can coat a bladed weapon or up to 5 pieces of ammunition. Applying it takes 1 minute. For 1 hour, the coated weapon or ammo becomes magical and gets a +3 bonus to attack and damage rolls",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Oil of Slipperiness",
      "category": "Potion",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A thick, clear oil. You can apply it to yourself (or pour it on the ground). If applied to a creature, it gains the effect of the **Freedom of Movement** spell for 8 hours (no restraint, no reduction of speed). If poured on a surface, it replicates the effect of a **Grease** spell (10-foot square of slippery ground) for 8 hours",
      "spells": [
        "Freedom of Movement",
        "Grease"
      ],
      "publication": "SRD"
    },
    {
      "name": "Orb of Direction",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "While holding this small glass orb, you can use an action to determine which way is north. The orb gently rotates or illuminates to indicate the direction of true north, no matter your location (even if underground or on another plane)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Orb of Dragonkind",
      "category": "Wondrous item",
      "rarity": "artifact",
      "attunement": true,
      "description": "One of a set of legendary crystal orbs created by dragons. Each orb is linked to a dragon type (chromatic). The orb allows the attuned wielder to communicate with and control dragons of the associated type (contested Charisma checks). It also has a suite of powerful spells (e.g., **Bless**, **Cure Wounds**, **Daylight**, **Scrying**, **Teleport**, etc.) and radiates an aura that can frighten dragons. However, each orb houses the essence of an evil dragon and may try to dominate or corrupt the user. The orbs are extremely powerful and dangerous artifacts",
      "spells": [
        "Bless",
        "Cure Wounds",
        "Daylight",
        "Scrying",
        "Teleport"
      ],
      "publication": "SRD"
    },
    {
      "name": "Orb of Time",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A small crystalline orb that, when held, gives you a sense of the current time of day. By peering into the orb, you can tell whether it is morning, afternoon, evening, or night outside (regardless of your location). It’s often used by dwellers underground to keep time",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Pearl of Power",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While attuned to this pearl and holding it, you can use an action to regain one expended spell slot (up to 3rd level). Once you use the pearl, it can’t be used again until the next dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Perfume of Bewitching",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A vial of sweet perfume. You can use an action to apply it to yourself, and for the next hour you have advantage on all Charisma checks directed at humanoids of Challenge Rating 1 or lower. Creatures of CR 1 or lower will generally view you favorably (as if charmed) for that duration, unless you or your allies attack them",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Periapt of Health",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A pendant that protects against sickness. While wearing it, you are immune to contracting any disease. If you are already infected with a disease, the symptoms are suspended while you wear the periapt",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Periapt of Proof against Poison",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "An amulet dangling a clear gemstone. While worn, it grants immunity to poison: you are immune to the poisoned condition and to poison damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Periapt of Wound Closure",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "A crystal amulet on a chain. While attuned and wearing it, whenever you roll a Hit Die to regain hit points, you double the number of HP restored. In addition, if you have this periapt on your person, whenever you start your turn at 0 HP, you automatically stabilize",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Philter of Love",
      "category": "Potion",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A rose-hued effervescent potion. The next time you see a creature within 10 minutes of drinking it, you become charmed by that creature for 1 hour (as if affected by a **Charm Person** spell). If the creature is of a gender and species you’d normally be attracted to, you regard it as your true love while charmed",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Pipe of Smoke Monsters",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A whimsical wooden pipe. If you smoke it, you can use an action to exhale a puff of smoke that takes the form of a single creature (like a dragon, horse, etc.) for a few seconds before dissipating. The form is non-substantial and disappears quickly",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Pipes of Haunting",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A set of panpipes with frightful carvings. It has 3 charges. If you are proficient with wind instruments, you can use an action to play them and expend 1 charge to create an eerie tune. Creatures of your choice within 30 feet that hear it must make a DC 15 Wisdom save or be frightened of you for 1 minute. A target that saves is immune to these pipes for 24 hours. The pipes regain 1d3 charges each dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Pipes of the Sewers",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "These wooden pipes have 3 charges. If you are proficient with wind instruments, you can use an action to play a shrill tune and expend 1 to 3 charges. For each charge expended, you summon a swarm of rats (50% chance for a giant rat instead) that emerge 1 round later. The swarms obey your musical commands. After 1 hour, they disappear or when you stop playing. The pipes regain 1d3 charges daily. If you expend the last charge, roll a d20; on a 1, the pipes lose their magic",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Plate Armor of Etherealness",
      "category": "Armor",
      "rarity": "legendary",
      "attunement": true,
      "description": "Plate armor (AC 18) that allows the wearer to phase into the Ethereal Plane. You can use an action to cast **Etherealness** (no components required). The effect lasts up to 10 minutes or until you remove the armor. This property can’t be used again until the next dawn",
      "spells": [
        "Etherealness"
      ],
      "publication": "SRD"
    },
    {
      "name": "Pole of Angling",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A 10-foot pole that can, on command, transform into a fishing pole with a hook, line, and reel. It’s a mundane but useful tool for catching fish—it doesn’t guarantee success, but provides a proper fishing apparatus",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Pole of Collapsing",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A 10-foot pole that can collapse into a 1-foot rod. You can speak a command word to cause the pole to telescope out to 10 feet or collapse back to 1 foot. This doesn’t alter its weight (which is 2 pounds). It can be used as a ladder, pole, etc., and easily stowed when collapsed",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Portable Hole",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "A circular cloth, 6 feet in diameter, that can be unfolded onto a surface to create an extradimensional hole 10 feet deep. The interior is a space 10 ft across. You can climb in and out (rope recommended). Folding the cloth causes everything inside the hole to spill out. The cloth can be picked up (closing the hole). If placed inside an extradimensional container (like a Bag of Holding), it tears a rift to the Astral Plane, destroying both items",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Pot of Awakening",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A terra-cotta flower pot. If you plant a normal shrub in this pot and let it grow for 30 days, the shrub magically becomes an awakened shrub (gains sentience and limited mobility) at the end of that time. The awakened shrub is friendly to you. Only one shrub can be awakened at a time from the pot",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Animal Friendship",
      "category": "Potion",
      "rarity": "uncommon",
      "attunement": false,
      "description": "When you drink this potion, you can cast **Animal Friendship** (save DC 13) for 1 hour at will. The potion’s effect ends after one hour, and the liquid is consumed on first use",
      "spells": [
        "Animal Friendship"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Clairvoyance",
      "category": "Potion",
      "rarity": "rare",
      "attunement": false,
      "description": "Drinking this clear potion grants you the effect of the **Clairvoyance** spell. For the next hour, you can create an invisible sensor within 1 mile and see or hear through it (as per the spell). Once the effect ends, it does not recur",
      "spells": [
        "Clairvoyance"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Climbing",
      "category": "Potion",
      "rarity": "common",
      "attunement": false,
      "description": "For 1 hour after drinking it, you gain a climbing speed equal to your walking speed. You also gain advantage on Strength (Athletics) checks to climb during that duration",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Diminution",
      "category": "Potion",
      "rarity": "rare",
      "attunement": false,
      "description": "For 1d4 hours after drinking it, you gain the “reduce” effect of the **Enlarge/Reduce** spell: your size shrinks to one category smaller (to a minimum of Tiny), and your weight is reduced accordingly. You have disadvantage on Strength checks and saves, and your weapons deal less damage (per the spell)",
      "spells": [
        "Enlarge/Reduce"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Fire Breath",
      "category": "Potion",
      "rarity": "uncommon",
      "attunement": false,
      "description": "After drinking this potion, you can use a bonus action to exhale fire at a target within 30 feet. The target must make a DC 13 Dexterity save or take 4d6 fire damage (half on success). This effect can be used up to 3 times, or it ends 1 hour after you drink the potion (whichever comes first)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Flying",
      "category": "Potion",
      "rarity": "very rare",
      "attunement": false,
      "description": "When you drink this potion, you gain a flying speed equal to your walking speed for 1 hour and can hover. If the effect ends while you’re aloft and nothing else is holding you aloft, you fall",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Gaseous Form",
      "category": "Potion",
      "rarity": "rare",
      "attunement": false,
      "description": "Drinking this potion transforms you as if by the **Gaseous Form** spell for 1 hour (no concentration required). You and your gear become a misty cloud; you gain a flying speed of 10 ft, resistance to nonmagical damage, and can pass through small holes. The effect ends early if you dismiss it (bonus action) or if you drop to 0 HP",
      "spells": [
        "Gaseous Form"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Giant Strength",
      "category": "Potion",
      "rarity": "varies",
      "attunement": false,
      "description": "A potion that boosts Strength. The specific Strength score and potion rarity depends on the giant whose strength it mimics: Hill Giant (Str 21, Uncommon), Frost/Stone (Str 23, Rare), Fire (Str 25, Rare), Cloud (Str 27, Very Rare), Storm (Str 29, Legendary). The effect lasts for 1 hour",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Growth",
      "category": "Potion",
      "rarity": "uncommon",
      "attunement": false,
      "description": "For 1d4 hours after drinking it, you gain the “enlarge” effect of the **Enlarge/Reduce** spell: your size doubles in all dimensions (to a max of Large), your weight increases by eight times, and you have advantage on Strength checks and saves. Your weapons also grow and deal an extra 1d4 damage. After the duration, you return to normal size",
      "spells": [
        "Enlarge/Reduce"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Healing",
      "category": "Potion",
      "rarity": "varies",
      "attunement": false,
      "description": "A magical red fluid that restores hit points when drunk. **Common:** Regain 2d4+2 HP (Healing Potion); **Uncommon (Greater):** 4d4+4 HP; **Rare (Superior):** 8d4+8 HP; **Very Rare (Supreme):** 10d4+20 HP. The potion’s potency depends on its rarity",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Heroism",
      "category": "Potion",
      "rarity": "rare",
      "attunement": false,
      "description": "For 1 hour after drinking it, you gain 10 temporary hit points, and you are under the effect of the **Bless** spell (no concentration required, you add a d4 to attack rolls and saving throws for the duration)",
      "spells": [
        "Bless"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Invisibility",
      "category": "Potion",
      "rarity": "very rare",
      "attunement": false,
      "description": "After drinking this potion, you become invisible for 1 hour, as if under the **Invisibility** spell. The effect ends early if you attack or cast a spell",
      "spells": [
        "Invisibility"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Invulnerability",
      "category": "Potion",
      "rarity": "rare",
      "attunement": false,
      "description": "For 1 minute after drinking it, you have resistance to all damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Longevity",
      "category": "Potion",
      "rarity": "very rare",
      "attunement": false,
      "description": "This rare potion’s magic can extend your lifespan. When you drink it, your physical age is reduced by 1d6 + 6 years (to a minimum age of 13). Every time you consume another potion of longevity, there is a cumulative 10% chance that instead your age increases by that amount. You can only benefit from this reduction a limited number of times before fate catches up",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Mind Reading",
      "category": "Potion",
      "rarity": "rare",
      "attunement": false,
      "description": "For 1 hour after drinking it, you are able to read the thoughts of others as if by the **Detect Thoughts** spell (Wisdom save DC 13 to resist deeper probing)",
      "spells": [
        "Detect Thoughts"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Poison",
      "category": "Potion",
      "rarity": "uncommon",
      "attunement": false,
      "description": "This potion is actually a dangerous brew. It tastes and looks like a healing potion, but it is poison. If you drink it, you take 3d6 poison damage and must make a DC 13 Constitution save or be poisoned. While poisoned in this way, you take 3d6 poison damage at the start of each of your turns until cured. Because of its similarity to healing potions, it often fools the unwary",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Resistance",
      "category": "Potion",
      "rarity": "uncommon",
      "attunement": false,
      "description": "When you drink this potion, you gain resistance to one type of damage for 1 hour. The type is determined by the potion’s key ingredient (e.g., dragon scale for a certain element). Common examples include resistance to acid, cold, fire, force, lightning, necrotic, poison, psychic, radiant, or thunder damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Speed",
      "category": "Potion",
      "rarity": "very rare",
      "attunement": false,
      "description": "When you drink this potion, you gain the effect of the **Haste** spell for 1 minute (no concentration required). For the duration, your speed is doubled, you gain +2 AC, advantage on Dexterity saves, and an extra action each turn (limited to attack [one weapon attack], dash, disengage, hide, or use object). After 1 minute, you suffer the normal lethargy when the effect ends (no actions for 1 round)",
      "spells": [
        "Haste"
      ],
      "publication": "SRD"
    },
    {
      "name": "Potion of Vitality",
      "category": "Potion",
      "rarity": "very rare",
      "attunement": false,
      "description": "When you drink this syrupy potion, it removes any exhaustion you are suffering, and cures any disease or poison affecting you. For the next 24 hours, whenever you roll a Hit Die to regain hit points, treat the die as if it rolled its maximum value",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Potion of Water Breathing",
      "category": "Potion",
      "rarity": "uncommon",
      "attunement": false,
      "description": "After drinking this potion, you can breathe underwater for 1 hour. This potion is often carried by adventurers exploring aquatic environments",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Quaal's Feather Token",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "A magic feather with one of several enchantments (determined randomly or by choice). Examples: **Anchor** (feather becomes an immovable anchor), **Bird** (giant bird appears to serve as mount for a day), **Fan** (creates gust of wind), **Swan Boat** (forms a boat), etc. Each token can be used once to create a specific effect then becomes nonmagical",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Quiver of Ehlonna",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "Also known as a Efficient Quiver, this quiver has multiple compartments that hold far more ammunition and gear than a normal quiver. Each compartment can hold a certain amount: e.g., the longest compartment can hold up to 6 long objects like bows or quarterstaffs, the mid-size up to 18 javelins or similar, and the shortest up to 60 arrows or bolts. The quiver always weighs 2 lbs. You can draw any stored item as if from a regular quiver or scabbard",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Animal Influence",
      "category": "Ring",
      "rarity": "rare",
      "attunement": false,
      "description": "This ring has 3 charges. While wearing it, you can expend an action and some charges to cast one of the following spells (save DC 13): **Animal Friendship** (1 charge), **Fear** targeting only beasts (2 charges), or **Speak with Animals** (1 charge). The ring regains 1d3 charges at dawn",
      "spells": [
        "Animal Friendship",
        "Fear",
        "Speak with Animals"
      ],
      "publication": "SRD"
    },
    {
      "name": "Ring of Djinni Summoning",
      "category": "Ring",
      "rarity": "legendary",
      "attunement": true,
      "description": "While wearing this ring, you can speak its command word to summon a specific djinni from the Elemental Plane of Air. The djinni appears for up to 1 hour and is friendly to you (acting on your initiative count). It serves you and obeys your commands, even fighting on your behalf. It can be summoned once per day. Misusing the djinni or rolling a natural 1 on an attack roll while it’s summoned might free it from service (at the DM’s discretion)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Elemental Command",
      "category": "Ring",
      "rarity": "legendary",
      "attunement": true,
      "description": "There are four variants of this ring (Air, Earth, Fire, Water). Each grants various powers related to its element once certain conditions are met (like defeating an elemental of that type to awaken the ring’s full power). For example, the Ring of Fire Elemental Command might grant resistance to fire, the ability to speak Ignan, and spells like **Burning Hands**, **Fireball**, **Wall of Fire**, etc., along with the ability to **Dominate** a fire elemental. Each ring is extremely powerful when fully activated",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Evasion",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "This ring has 3 charges. When you fail a Dexterity saving throw while wearing it, you can use your reaction to expend 1 charge to succeed on that saving throw instead. The ring regains 1d3 expended charges daily at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Feather Falling",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "While wearing this ring, you descend slowly. You automatically fall at a rate of 60 feet per round and take no damage from falling, no matter the distance (as if under a continuous **Feather Fall** effect)",
      "spells": [
        "Feather Fall"
      ],
      "publication": "SRD"
    },
    {
      "name": "Ring of Free Action",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "While attuned and wearing this ring, you are unaffected by difficult terrain, and magic cannot reduce your speed or cause you to be paralyzed or restrained. If you are already restrained by nonmagical means, you can spend 5 feet of movement to automatically escape",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Invisibility",
      "category": "Ring",
      "rarity": "legendary",
      "attunement": true,
      "description": "While wearing this ring, you can turn invisible as an action. The invisibility doesn’t end when you attack or cast a spell – it lasts until you remove the ring or until the ring is deactivated. However, the ring’s magic craves secrecy; if someone sees you while you’re invisible (due to Truesight, for example), the ring’s invisibility may falter temporarily",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Jumping",
      "category": "Ring",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this ring, you can cast the **Jump** spell on yourself at will (as a bonus action)",
      "spells": [
        "Jump"
      ],
      "publication": "SRD"
    },
    {
      "name": "Ring of Mind Shielding",
      "category": "Ring",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this ring, you are immune to magic that allows other creatures to read your thoughts, discern if you’re lying, know your alignment, or know your creature type. You can also choose to be undetectable to telepathy. Additionally, if you die while wearing the ring, your soul can choose to pass into the ring instead of moving on, where it can remain and communicate telepathically. The ring then keeps your soul unless someone else tries to attune to it",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Poison Resistance",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "While wearing this ring, you have resistance to poison damage. (This ring is one of many **Ring of Resistance** variants, each granting resistance to a specific damage type)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Protection",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "You gain a +1 bonus to AC and to all saving throws while wearing this ring",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Regeneration",
      "category": "Ring",
      "rarity": "very rare",
      "attunement": true,
      "description": "While wearing this ring, you regain 1d6 hit points every 10 minutes, provided you have at least 1 HP. Additionally, if you lose a body part, the ring causes it to regrow after 1d6 + 1 days as long as you wear the ring that whole time",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Resistance",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "One of several rings that grant resistance to a particular damage type. When you attune, the ring’s type becomes fixed. For example, a Ring of Cold Resistance grants you resistance to cold damage while worn. Other variants exist for fire, lightning, necrotic, etc.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Shooting Stars",
      "category": "Ring",
      "rarity": "very rare",
      "attunement": true,
      "description": "This ring can only be used outdoors at night. It has 6 charges. You can expend charges to create magical effects: for example, with 1 charge you can create **Dancing Lights** or a ball of light that hovers and explodes (like a **Fireball** but only 4d12 damage, Dex DC 15); with 2 charges you can cast **Faerie Fire**; with 3 charges you can call down a 120-ft long, 5-ft wide lightning bolt for 4d6 lightning (Dex DC 15 half). The ring regains 1d6 charges daily at dusk",
      "spells": [
        "Dancing Lights",
        "Faerie Fire"
      ],
      "publication": "SRD"
    },
    {
      "name": "Ring of Spell Storing",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "This ring can store up to 5 levels worth of spells (at most, five level-1 spells, or one level-5 spell, etc.). Any creature can cast a spell into the ring by touching it (the spell has no effect but is stored). The ring can hold the spell indefinitely. The attuned wearer can cast any spell stored in the ring, using the spell’s normal parameters, and once cast from the ring, that spell is expended from storage. The ring initially is empty when found",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Spell Turning",
      "category": "Ring",
      "rarity": "legendary",
      "attunement": true,
      "description": "While wearing this ring, you have advantage on saving throws against any spell that targets only you (not in an area). Additionally, if you succeed on such a save and the spell is 7th level or lower, it has no effect on you and is reflected back at the caster as if it were the spell’s target",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Swimming",
      "category": "Ring",
      "rarity": "uncommon",
      "attunement": false,
      "description": "While wearing this ring, you have a swimming speed of 40 feet",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Telekinesis",
      "category": "Ring",
      "rarity": "very rare",
      "attunement": true,
      "description": "While wearing this ring, you can cast **Telekinesis** at will, but only targeting objects that aren’t being worn or carried (no concentration required for these objects). Additionally, you can attempt to manipulate creatures with Telekinesis as normal by concentrating (save DC 18)",
      "spells": [
        "Telekinesis"
      ],
      "publication": "SRD"
    },
    {
      "name": "Ring of the Ram",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "This ring has 3 charges. While wearing it, you can use an action to expend 1 to 3 charges to attack one creature within 60 feet with a spectral ram’s head. It’s a ranged spell attack with +7 bonus. On a hit, for each charge spent, the target takes 2d10 force damage. Alternatively, you can expend 1 to 3 charges to try to break an object or push a creature (if creature, it makes a DC 17 Strength save or is pushed 5 feet per charge spent). The ring regains 1d3 charges each dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Three Wishes",
      "category": "Ring",
      "rarity": "legendary",
      "attunement": false,
      "description": "This ring has 3 charges and holds the **Wish** spell. While wearing it, you can expend 1 charge to cast **Wish**. Once all charges are used, the ring becomes nonmagical. Because **Wish** is so powerful, many consider this ring one of the most coveted but dangerous items in existence",
      "spells": [
        "Wish"
      ],
      "publication": "SRD"
    },
    {
      "name": "Ring of Warmth",
      "category": "Ring",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing this ring, you have resistance to cold damage. Also, you and everything you wear or carry are unharmed by temperatures as low as -50 degrees Fahrenheit",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of Water Walking",
      "category": "Ring",
      "rarity": "uncommon",
      "attunement": false,
      "description": "While wearing this ring, you can stand on and move across any liquid surface as if it were solid ground",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ring of X-ray Vision",
      "category": "Ring",
      "rarity": "rare",
      "attunement": true,
      "description": "While wearing this ring, you can use an action to see into and through solid matter (as if by **X-ray**). This special sight lasts for 1 minute. During that time, you can see through up to 1 foot of stone, 1 inch of common metal, or up to 3 feet of wood/dirt. Thicker substances or a thin sheet of lead block this vision. It can be used again after 1 minute on, 1 minute off (alternating usage). After three total minutes of use in a day, you must succeed on a DC 15 Constitution save when activating it or gain one level of exhaustion",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Robe of Eyes",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "A robe covered in dozens of ritualistic eye patterns. While wearing it, you have advantage on Wisdom (Perception) checks that rely on sight, you have darkvision out to 120 ft, and you can see invisible creatures and objects as well as into the Ethereal Plane (out to 120 ft). However, you have disadvantage on sight-based saves against bright light (like a Medusa’s glare or **Sunburst** spell) and are vulnerable to flash/blinding effects. If you are targeted by a spell like **Antimagic Field** or your robe goes through an **Antimagic** effect, all the eyes on it close (negating its benefits) until you’re out of the area",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Robe of Scintillating Colors",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "A robe with color-changing patches. It has 3 charges. You can use an action to expend 1 charge, causing the robe’s colors to shimmer and glow for 1 minute. During this time, the robe sheds bright light (30 ft) and dim light (another 30 ft). Any creature that starts its turn within 30 ft and can see you must make a DC 15 Wisdom save or be stunned until the start of its next turn. Additionally, attacks against you have disadvantage. The robe regains 1d3 charges daily",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Robe of Stars",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "A black or dark blue robe speckled with star-like motes. It has 6 stars (represented by cloth patches). While wearing the robe, you gain a +1 bonus to all saving throws. You can also use an action to pull off one of the stars, causing it to become a **Magic Missile** spell (cast at 5th level). Once all stars are used, the robe still offers its save bonus. Additionally, while wearing it, you can use an action to enter the Astral Plane (along with any worn/carried items). You remain there until you use another action to return. This property can’t be used again until the next dawn",
      "spells": [
        "Magic Missile"
      ],
      "publication": "SRD"
    },
    {
      "name": "Robe of the Archmagi",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "A regal robe that can be attuned by a sorcerer, warlock, or wizard of a specific alignment (each robe is made for neutral, good, or evil). It grants AC 15 + Dex mod while you are not wearing armor, and you have advantage on saving throws against spells and other magical effects. Additionally, your spell save DC and spell attack rolls gain a +2 bonus. Only the intended alignment wearer can attune; others take heavy damage if they try",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Robe of Useful Items",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A robe with many cloth patches of various shapes. It initially has 4d4 patches, each with a simple illustration. You can use an action to detach a patch, causing it to become the object depicted. Standard patches include things like: a 10-foot pole, a ladder, a riding horse, a pit, bags of gold, potions of healing, etc. Once a patch is removed, it can’t be used again. When all patches are gone, the robe is just an ordinary garment",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Rod of Absorption",
      "category": "Rod",
      "rarity": "very rare",
      "attunement": true,
      "description": "This rod can absorb magical energy directed at its holder. While attuned and holding it, whenever you are targeted by a spell, the rod can absorb the spell (along with its effects) if it has charges available. It can absorb up to 50 levels of spells over its lifetime. Once it absorbs a spell, you can use the stored levels to cast spells you have prepared (without expending your own slots). The rod cannot absorb spells that don’t target only you or that exceed its remaining capacity. Once it absorbs 50 levels, it can’t absorb more (but can still be used to cast out stored energy)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Rod of Alertness",
      "category": "Rod",
      "rarity": "very rare",
      "attunement": true,
      "description": "This rod grants heightened awareness. While holding it, you have advantage on Wisdom (Perception) checks and on initiative rolls. It also has magical spells: you can use an action to cast **Detect Evil and Good**, **Detect Magic**, **Detect Poison and Disease**, or **See Invisibility** without expending charges. Additionally, once per day, you can plant the rod in the ground (action) to activate an aura for 1 minute: you and allies in a 60-ft radius gain +1 bonus to AC and saving throws and can’t be surprised",
      "spells": [
        "Detect Evil and Good",
        "Detect Magic",
        "Detect Poison and Disease",
        "See Invisibility"
      ],
      "publication": "SRD"
    },
    {
      "name": "Rod of Lordly Might",
      "category": "Rod",
      "rarity": "legendary",
      "attunement": true,
      "description": "A mighty rod that can transform into various weapons. It has several buttons: one turns it into a flame-tongue sword, one into a +3 mace, one into a battleaxe, one extends it into a 50-foot climbing pole, one turns it into a battering ram, etc. It also can drain life: on a hit, you can force a target to make a DC 17 Constitution save or take an extra 4d6 necrotic and you heal that much. It has limited charges for some abilities (recharging daily). This rod is a powerful and versatile weapon and tool",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Rod of Resurrection",
      "category": "Rod",
      "rarity": "legendary",
      "attunement": true,
      "description": "This rod has 5 charges and regains 1 expended charge daily at dawn. If you are holding it, you can use an action to expend 1 charge to cast **Cure Wounds** at 5th level, or expend 5 charges to cast **Resurrection**. The rod can bring someone back from the dead or heal with powerful magic, but if it ever uses the last charge, roll a d20; on a 1, the rod crumbles into dust",
      "spells": [
        "Cure Wounds",
        "Resurrection"
      ],
      "publication": "SRD"
    },
    {
      "name": "Rod of Rulership",
      "category": "Rod",
      "rarity": "rare",
      "attunement": true,
      "description": "While holding this rod, you can use an action to present it and command obedience. Each creature of your choice within 120 feet that can see you must succeed on a DC 15 Wisdom save or be charmed by you for 8 hours. While charmed, they regard you as their trusted leader. If you or your allies harm them, or give obviously suicidal orders, they can repeat the save to end the effect. This ability can be used once per dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Rod of Security",
      "category": "Rod",
      "rarity": "very rare",
      "attunement": false,
      "description": "This rod can create a safe extraplanar haven. You can use an action to activate it, transporting yourself and up to 199 other willing creatures to a paradise demiplane where they experience true bliss, rest, and recuperation. The rod can maintain this paradise for a number of days equal to 200 divided by the number of creatures present (so more creatures means shorter duration). All creatures are fed, sheltered, and healed as if they had full rest. When time is up or you choose to end it, all return to the point of departure. The rod can’t be used again for 10 days",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Rod of the Pact Keeper, +X",
      "rarity": "varies",
      "category": "Rod",
      "attunement": "Requires attunement by a warlock",
      "is_consumable": false,
      "formula_source": "DMG 2014",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "DMG 2014",
      "aliases": [],
      "notes": "",
      "variants": [
        {
          "name": "Rod of the Pact Keeper, +1",
          "rarity": "uncommon"
        },
        {
          "name": "Rod of the Pact Keeper, +2",
          "rarity": "rare"
        },
        {
          "name": "Rod of the Pact Keeper, +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Rope of Climbing",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A 60-foot length of silk rope that obeys commands. You can use a bonus action to command the rope to move or knot itself. It can move 10 feet on your turn when commanded. For example, you can command it to snake its way up a wall and fasten itself to something. It can hold up to 3,000 pounds and has AC 20 and 20 HP. If cut, it regenerates when mended together",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Rope of Entanglement",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "This 30-foot long rope can be commanded to entangle a target. You can use an action to speak its command word and target a creature within 20 feet. The rope darts toward the target, which must succeed on a DC 15 Dexterity save or be restrained. It can repeat the save each turn to try to escape. You can release the creature by ordering the rope to uncoil",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Rope of Mending",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A 50-foot hempen rope that can magically repair itself. If cut, you can hold the severed ends together and speak the command word. The rope instantly knits back together, good as new",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ruby of the War Mage",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": true,
      "description": "A small ruby that can be attached to a weapon. Once attached and attuned, it allows you to use that weapon as a spellcasting focus for your spells (if you could normally use an arcane focus). This allows, for example, a wizard or sorcerer to cast spells while wielding a sword with the ruby affixed",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Saddle of the Cavalier",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A well-crafted riding saddle. While seated in this saddle on a mount, you can’t be dismounted against your will (attackers can’t cause you to fall off your mount), and you have advantage on saving throws to avoid falling off. It provides exceptional security for mounted combat",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Scarab of Protection",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "A beetle-shaped amulet that provides potent defense against evil. While attuned, you gain advantage on saves against spells. Additionally, the scarab has 12 charges. If you fail a saving throw against a necromancy spell or a spell from an undead creature, you can expend 1 charge as a reaction to turn the failed save into a successful save. The scarab crumbles when it has no charges left. Also, the scarab automatically alerts you if an undead is within 30 feet of you",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Scimitar of Speed",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "A magic scimitar +2 that grants incredible swiftness. You gain a +2 bonus to attack and damage with it. In addition, you can make one attack with it as a bonus action on each of your turns",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Scroll of Protection",
      "category": "Scroll",
      "rarity": "rare",
      "attunement": false,
      "description": "A protective scroll tuned to a specific creature type (such as fiends, undead, elementals, etc.). Using an action, you read the scroll to create an invisible barrier around you for 5 minutes. The barrier prevents creatures of the specified type from entering or affecting anything within. The scroll then crumbles. Each scroll is effective against one type of creature (specified on the scroll)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sending Stones",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A pair of smooth stones with matching engravings. One stone is kept by you, the other by whomever you give it to. While you have one, you can use an action to cast **Sending** from it (targeting the bearer of the other stone). The spell is delivered without chance of failure (regardless of plane). Once **Sending** is used, it can’t be used again until the next dawn. Essentially, it’s a two-way long-distance communication device",
      "spells": [
        "Sending"
      ],
      "publication": "SRD"
    },
    {
      "name": "Sentinel Shield",
      "category": "Armor",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A emblazoned shield that heightens alertness. While holding this shield, you have advantage on initiative rolls and on Wisdom (Perception) checks. The shield’s face is often decorated with an eye motif, signifying vigilance",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Shield of Expression",
      "category": "Armor",
      "rarity": "common",
      "attunement": false,
      "description": "A shield with a humanoid face embossed on it. As a bonus action, you can change the facial expression shown on the shield (smiling, angry, sad, etc.). This has no mechanical effect but can be used for intimidation or amusement",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Shield of Missile Attraction",
      "category": "Armor",
      "rarity": "rare",
      "attunement": true,
      "description": "A cursed +2 shield. While attuned, you have resistance to damage from ranged weapon attacks. However, all ranged weapon attacks target you over others: any ranged weapon attack that could hit a creature within 10 feet of you targets you instead. You cannot end the attunement to this shield voluntarily unless you are targeted by **Remove Curse**",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Shield, +X",
      "rarity": "varies",
      "category": "Shield",
      "attunement": false,
      "is_consumable": false,
      "formula_source": "DMG 2014",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "DMG 2014",
      "aliases": [
        "+1 shield",
        "+2 shield",
        "+3 shield"
      ],
      "notes": "",
      "variants": [
        {
          "name": "Shield, +1",
          "rarity": "uncommon"
        },
        {
          "name": "Shield, +2",
          "rarity": "rare"
        },
        {
          "name": "Shield, +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Slippers of Spider Climbing",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While wearing these lightweight shoes, you can stand on and walk along walls or ceilings as if you were on the ground. You have a climbing speed equal to your walking speed. However, the slippers don’t allow you to move this way on slippery surfaces (like ice or oil)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Smoldering Armor",
      "category": "Armor",
      "rarity": "common",
      "attunement": false,
      "description": "A suit of armor that, while worn, constantly emits harmless, odorless wisps of smoke. It doesn’t provide any special protection or disadvantage; it just gives a dramatic, smoky effect to your appearance",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sovereign Glue",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": false,
      "description": "A viscous milky-white adhesive. One drop can cover a 1-foot square. It bonds almost any two objects together permanently. The glue takes 1 minute to set. Only a **Wish** spell or **Universal Solvent** can dissolve it once it sets. It’s incredibly strong; separating bonded items requires destroying one of them. Typically found in a jar with only a small quantity (d6+1 ounces)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Spell Scroll",
      "category": "Scroll",
      "rarity": "varies",
      "attunement": false,
      "description": "A single-use scroll containing a spell. The spell’s level determines the scroll’s rarity (Common for cantrip or 1st level, Uncommon for 2nd–3rd, Rare 4th–5th, Very Rare 6th–8th, Legendary 9th). If the spell is on your class’s spell list, you can cast it from the scroll (using the scroll’s casting time) without providing components. Otherwise, the scroll is unintelligible. After casting, the scroll’s text fades. If the spell’s level is higher than you can normally cast, you must make an ability check to cast it (DC 10 + spell level) or the spell fails",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Spellguard Shield",
      "category": "Armor",
      "rarity": "very rare",
      "attunement": true,
      "description": "A shield that bears protective enchantments against magic. While holding this shield, you have advantage on saving throws against spells and magical effects, and spell attacks have disadvantage against you",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sphere of Annihilation",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": false,
      "description": "A 2-foot diameter black sphere that obliterates matter. It’s a hole in the multiverse that disintegrates everything it touches. Moving it requires a mental contest (Arcana check) and it can be very dangerous to control (if you lose control, it can move toward you). Anything that comes into contact with the sphere (that isn’t protected by powerful magic) is instantly destroyed, obliterated from existence. This is an artifact-level item and often guarded by powerful forces or traps:contentReference[oaicite:6]{index=6}",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Staff of Adornment",
      "category": "Staff",
      "rarity": "common",
      "attunement": false,
      "description": "A simple wooden staff with a decorative top. You can use an action to cause a Small object (up to 1 pound) to float an inch above the tip of the staff and remain there until you remove it or another object takes its place. You can have up to three objects orbiting the staff’s tip in this way. It’s mostly a cosmetic or convenience effect (for displaying trinkets or keeping a torch aloft, etc.)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Staff of Birdcalls",
      "category": "Staff",
      "rarity": "common",
      "attunement": false,
      "description": "This wooden staff has 10 charges. While holding it, you can use an action to expend 1 charge and cause the staff to emit one of several common bird calls (like a finch’s chirp, a raven’s caw, a duck’s quack, etc.). It regains 1d6+4 charges each day at dawn. It’s primarily an amusement or tool for hunters to mimic bird sounds",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Staff of Charming",
      "category": "Staff",
      "rarity": "rare",
      "attunement": true,
      "description": "This staff has 10 charges and can be wielded as a magic quarterstaff. While holding it, you can expend charges to cast the following spells (save DC 15): **Charm Person** (1 charge), **Command** (1 charge), or **Comprehend Languages** (1 charge). The staff regains 1d8+2 charges at dawn. If you expend the last charge, roll d20; on a 1, it loses its magic. Attacks with the staff use your spell attack bonus for hit and damage",
      "spells": [
        "Charm Person",
        "Command",
        "Comprehend Languages"
      ],
      "publication": "SRD"
    },
    {
      "name": "Staff of Fire",
      "category": "Staff",
      "rarity": "very rare",
      "attunement": true,
      "description": "This staff can be used as a +2 quarterstaff and has 10 charges. While holding it, you can expend charges to cast the following spells (save DC 15): **Burning Hands** (1 charge), **Fireball** (3 charges), **Wall of Fire** (4 charges). It regains 1d6+4 charges daily at dawn. If you expend the last charge, roll d20; on a 1, the staff blackens and crumbles to ashes",
      "spells": [
        "Burning Hands",
        "Fireball",
        "Wall of Fire"
      ],
      "publication": "SRD"
    },
    {
      "name": "Staff of Flowers",
      "category": "Staff",
      "rarity": "common",
      "attunement": false,
      "description": "This wooden staff has 10 charges. While holding it, you can use an action to expend 1 charge and cause a flower to sprout from a patch of earth or soil within 5 feet. The flower is mundane (nonmagical) and can be of any type you choose (sunflower, rose, lily, etc.), though it withers normally. The staff regains 1d6+4 charges each day at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Staff of Frost",
      "category": "Staff",
      "rarity": "very rare",
      "attunement": true,
      "description": "This staff can be used as a +2 quarterstaff and has 10 charges. It requires attunement by a druid, sorcerer, warlock, or wizard. While holding it, you can expend charges (spell save DC 15) to cast: **Cone of Cold** (5 charges), **Fog Cloud** (1 charge), **Ice Storm** (4 charges), or **Wall of Ice** (4 charges). It also grants resistance to cold damage while attuned. The staff regains 1d6+4 charges each dawn. If the last charge is expended, roll d20; on a 1, the staff turns to ice and melts away",
      "spells": [
        "Cone of Cold",
        "Fog Cloud",
        "Ice Storm",
        "Wall of Ice"
      ],
      "publication": "SRD"
    },
    {
      "name": "Staff of Healing",
      "category": "Staff",
      "rarity": "rare",
      "attunement": true,
      "description": "This staff has 10 charges. It can be attuned by a bard, cleric, or druid. While holding it, you can use an action to expend charges to cast one of the following spells using your spellcasting ability: **Cure Wounds** (1 charge per spell level, up to 4th), **Lesser Restoration** (2 charges), or **Mass Cure Wounds** (5 charges). The staff regains 1d6+4 charges daily at dawn. If you expend the last charge, roll d20; on a 1, the staff withers into dust",
      "spells": [
        "Cure Wounds",
        "Lesser Restoration",
        "Mass Cure Wounds"
      ],
      "publication": "SRD"
    },
    {
      "name": "Staff of Power",
      "category": "Staff",
      "rarity": "very rare",
      "attunement": true,
      "description": "This staff functions as a +2 quarterstaff. It has 20 charges and can be attuned by a sorcerer, warlock, or wizard. While holding it, you gain +2 to spell attack rolls. You can use an action to expend charges to cast spells (save DC 17) such as **Lightning Bolt** (3 charges), **Fireball** (5 charges), **Cone of Cold** (5 charges), **Hold Monster** (5 charges), **Wall of Force** (5 charges). It also grants other benefits: advantage on saving throws vs spells, etc. If you drop to 0 HP while holding it, you can choose to break the staff, performing a Retributive Strike that deals massive damage in an area (destroying the staff). The staff regains 2d8+4 charges daily. If the last charge is expended, roll a d20; on a 1, the staff loses its magic (but doesn’t explode)",
      "spells": [
        "Lightning Bolt",
        "Fireball",
        "Cone of Cold",
        "Hold Monster",
        "Wall of Force"
      ],
      "publication": "SRD"
    },
    {
      "name": "Staff of Striking",
      "category": "Staff",
      "rarity": "very rare",
      "attunement": true,
      "description": "This is a magic quarterstaff +3. It has 10 charges. When you hit with a melee attack using the staff, you can expend up to 3 charges to deal an extra 1d6 force damage per charge expended. The staff regains 1d6+4 expended charges each day at dawn. If you expend the last charge, roll d20; on a 1, the staff loses its magic bonus (becoming a nonmagical quarterstaff)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Staff of Swarming Insects",
      "category": "Staff",
      "rarity": "rare",
      "attunement": true,
      "description": "This staff has 10 charges. While holding it, you can use an action to expend some charges to cast one of the following (spell save DC 15): **Giant Insect** (4 charges) or **Insect Plague** (5 charges). You can also expend 1 charge to create a swarm of harmless flying insects around you (providing lightly obscuring cover) for 10 minutes. The staff regains 1d6+4 charges each dawn. If you expend the last charge, roll d20; on a 1, the staff crumbles into a swarm of insects and is destroyed",
      "spells": [
        "Giant Insect",
        "Insect Plague"
      ],
      "publication": "SRD"
    },
    {
      "name": "Staff of the Adder",
      "category": "Staff",
      "rarity": "uncommon",
      "attunement": true,
      "description": "This serpent-headed staff can transform its head into a venomous snake. You can use a bonus action to speak a command word and turn the staff’s head into a live snake’s head for 1 minute. You can then use the staff to make melee attacks (using your proficiency) that deal 1d6 piercing plus 3d6 poison damage. The snake head can be attacked (AC 15, 20 HP). If it drops to 0 HP, the head is destroyed and reverts, and the staff loses this power. You can’t use the transformation again until the next dawn if the snake is killed",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Staff of the Magi",
      "category": "Staff",
      "rarity": "legendary",
      "attunement": true,
      "description": "A legendary staff for sorcerers, warlocks, or wizards, combining immense magical power. It functions as a +2 quarterstaff. It has 50 charges and holds almost every wizard spell (from **Fireball** to **Lightning Bolt**, **Passwall**, **Telekinesis**, etc.), allowing you to cast them by expending charges instead of spell slots (using your save DC). It regains 4d6+2 charges daily. If you expend the last charge, roll d20; on a 20, it regains 1 charge. On any other result, it loses magic and, if broken deliberately as a last resort, causes a devastating Retributive Strike (like a mini-explosion of magical energy). The staff also provides absorption of spells like a Rod of Absorption. A staff of this caliber is an artifact-level item",
      "spells": [
        "Fireball",
        "Lightning Bolt",
        "Cone of Cold",
        "Wall of Fire",
        "Passwall",
        "Telekinesis",
        "Detect Magic",
        "Enlarge/Reduce",
        "Invisibility"
      ],
      "publication": "SRD"
    },
    {
      "name": "Staff of the Python",
      "category": "Staff",
      "rarity": "uncommon",
      "attunement": true,
      "description": "You can use an action to speak this staff’s command word and throw it on the ground. It transforms into a Giant Constrictor Snake under your control. The snake acts on its own initiative but obeys your verbal commands. The snake exists for up to 1 hour or until it drops to 0 HP, at which point it reverts to staff form. It reverts early if you use a bonus action to speak the command word again or if you die. When the snake reverts, it returns to staff form (and any remaining damage it had carries over to the staff). If the staff is destroyed, it is lost forever",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Staff of the Woodlands",
      "category": "Staff",
      "rarity": "rare",
      "attunement": true,
      "description": "This oak staff can be wielded as a +2 quarterstaff. It can be attuned by a druid and has 10 charges. While holding it, you can expend charges (spell save DC 15) to cast spells: **Animal Friendship** (1 charge), **Awaken** (5 charges), **Barkskin** (2 charges), **Locate Animals or Plants** (2 charges), **Speak with Animals** (1 charge), **Speak with Plants** (3 charges), or **Wall of Thorns** (6 charges). The staff regains 1d6+4 charges at dawn. Additionally, you can use an action to plant the staff in fertile earth and expend 1 charge to instantly transform it into a healthy tree (60-foot tall oak). The tree lasts for 1 day or until felled, after which the staff reappears in your hands",
      "spells": [
        "Animal Friendship",
        "Awaken",
        "Barkskin",
        "Locate Animals or Plants",
        "Speak with Animals",
        "Speak with Plants",
        "Wall of Thorns"
      ],
      "publication": "SRD"
    },
    {
      "name": "Staff of Thunder and Lightning",
      "category": "Staff",
      "rarity": "very rare",
      "attunement": true,
      "description": "This staff can be used as a +2 quarterstaff. It has 5 distinct magical effects, each usable once per dawn: **Thunderclap** (upon hitting a target, you can create a thunder boom: extra 2d6 thunder damage and deafen target, Con DC 17), **Lightning** (cast a 5d6 lightning bolt from the staff, 120 ft line, Dex DC 17 half), **Thunder and Lightning** (combine the above two effects on a hit), **Lightning Strike** (cast a lightning bolt as an action, 120 ft line, 9d6 damage, Dex DC 17 half), **Thunder Strike** (cause thunder on hit: 2d6 thunder damage and push target 10 ft, Con DC 17 or be stunned). Each effect uses a charge; total limited uses. Once all are used, it functions simply as a +2 staff until recharged at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Staff of Withering",
      "category": "Staff",
      "rarity": "rare",
      "attunement": true,
      "description": "This staff functions as a +1 quarterstaff. It has 3 charges. When you hit with a melee attack, you can expend 1 charge to deal an extra 2d10 necrotic damage. The target must also succeed on a DC 15 Constitution save or have disadvantage on Strength and Constitution checks for 1 hour (as their body withers). The staff regains 1d3 charges each dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Stone of Controlling Earth Elementals",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": false,
      "description": "If the stone is on the ground, you can use an action to speak its command word and summon an earth elemental, as if you had cast **Conjure Elemental**. The elemental is friendly and obeys your commands. It remains for up to 1 hour or until destroyed. The stone can’t be used this way again until the next dawn",
      "spells": [
        "Conjure Elemental"
      ],
      "publication": "SRD"
    },
    {
      "name": "Stone of Good Luck (Luckstone)",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "While this polished agate stone is on your person, you gain a +1 bonus to ability checks and saving throws. It’s a subtle but persistent boon to all your endeavors",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sun Blade",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "This item appears to be a hilt with no blade. When grasped, you can use a bonus action to cause a blade of pure radiance to spring forth, functioning as a longsword. You have proficiency with it even if not normally proficient. It deals radiant damage instead of slashing (1d8, or 1d10 versatile) and has the finesse property. It gives +2 bonus to attack and damage, and when you hit undead, it deals an extra 1d8 radiant. The blade emits bright sunlight in a 15-ft radius (and dim light 15 ft further). You can use an action to adjust the radius of light up or down",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sword of Answering",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "One of a set of legendary sentient longswords (each named). It is a +3 longsword with special reactive ability: if an enemy attacks you, you can use your reaction to make one melee attack back at them with advantage (you can’t use this if surprised). It also ignores resistance or immunity to slashing damage. Each Sword of Answering has a unique personality and alignment, often encouraging the wielder to act in accordance with its ethos",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sword of Kas",
      "category": "Wondrous item",
      "rarity": "artifact",
      "attunement": true,
      "description": "A wicked +3 longsword once wielded by Kas, the lieutenant of Vecna. It deals extra necrotic damage on a hit, grants the wielder a bonus to AC, saving throws, and immunity to charm. It possesses sentience and an evil ego. It can cast **Haste** on the wielder and demands blood. The sword also has a thirst for destroying Vecna and his creations. It is an artifact with many story-driven powers and potentially drawbacks (curses), known for betraying its master eventually. It shines with dark purpose and whispers to its user",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Sword of Life Stealing",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "A +1 magic sword that thirsts for life energy. When you score a critical hit with this weapon, it deals an extra 10 necrotic damage, and you gain 10 temporary hit points",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sword of Sharpness",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "A magic sword (usually longsword or greatsword) that slices through armor. On a 20 attack roll, it deals max damage plus an extra 14 slashing damage. Also, when you roll a 20, you lop off a limb of your choice from the target (if it has any and the DM deems it appropriate). When you attack an object with it, you deal double damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sword of Vengeance",
      "category": "Weapon",
      "rarity": "uncommon",
      "attunement": true,
      "description": "A +1 cursed sword that demands blood. Attuning curses you with berserker rage: if you are damaged in combat, you must succeed on a DC 15 Wisdom save or attack the nearest creature (even an ally) on your next turn. The sword also cannot be parted from willingly while cursed. Only a **Remove Curse** can break the attunement. Despite the curse, it is a +1 weapon",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Sword of Wounding",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "A magic sword +1 that causes persistent wounds. A creature hit by this sword can’t regain hit points until the start of your next turn. In addition, whenever you hit a creature, it takes 1d4 necrotic damage at the start of its turns for each time you’ve hit it (stacking wounds). The creature can make a DC 15 Constitution save at the end of its turn to stop all ongoing wound damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Talisman of Pure Good",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "A mighty holy amulet that can only be attuned by a creature of **good** alignment (cleric or paladin). While you wear it, any fiend or undead that attacks you has disadvantage. Additionally, if you are a cleric or paladin, you can use an action to invoke the talisman and smite an evil-aligned extraplanar creature: the target (within 30 ft) must make a DC 20 Charisma save or be consumed by holy fire (if 100 HP or fewer, it is instantly destroyed; if more, it takes 6d6 radiant). Once used, this property can’t be used until the next dawn. If a nongood creature touches the talisman, it takes 6d6 radiant damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Talisman of the Sphere",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "An amulet that aids in controlling a **Sphere of Annihilation**. If you are attuned and within 60 ft of a Sphere of Annihilation, you can use an action to control it better: you gain a +2 bonus to the Intelligence (Arcana) checks to move it, and if you tie for control with another creature, you win. Additionally, if you fail by 10 or more when moving the sphere with this talisman, it doesn’t automatically move toward you (so it mitigates some risk). Essentially, it grants mastery over that destructive artifact. However, the talisman offers no benefit if a Sphere isn’t present",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Talisman of Ultimate Evil",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "The counterpart to the Talisman of Pure Good, this amulet can only be attuned by an **evil** cleric or paladin (or similar). Fiends and undead friendly to you gain advantage on attacks against others nearby. If you are evil-aligned and attuned, you can use an action to touch the talisman to the ground, creating a fissure under the feet of a good-aligned creature you see within 120 feet. The target must make a DC 20 Dexterity save or fall into the fissure, which then closes – trapping the creature in a demiplane of torment forever (if they die there, their soul is damned). This power is usable once per dawn. If a nonevil creature touches the talisman, they take 8d6 necrotic damage",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Talking Doll",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": true,
      "description": "A small child’s doll crafted with minor enchantment. While attuned, you can teach the doll up to six phrases, each up to 6 words. You can also set conditions for the doll to say each phrase. For example, you can have it say “I love you” when someone picks it up, or utter a creepy giggle when it’s nighttime. The doll’s phrases can be changed whenever you spend 1 minute to teach it new words",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Tankard of Sobriety",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "This pewter tankard has a lid that seals tight. Any alcoholic beverage poured into it loses all alcoholic content. No matter how much you drink from this tankard, you will never become intoxicated. It’s a favorite of those who want to partake in social drinking without the negative effects",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Tentacle Rod",
      "category": "Rod",
      "rarity": "rare",
      "attunement": true,
      "description": "A rod topped with three rubbery tentacles. While holding it, you can use an action to direct each tentacle to strike a creature within 15 feet. The rod makes three melee attacks (using your spell attack modifier). If one or more tentacles hit, the target must make a DC 15 Constitution save or have its speed halved and suffer disadvantage on Dexterity saves for 1 minute. The creature can repeat the save at the end of each of its turns to end the effect. The rod’s attacks deal 1d6 bludgeoning damage each",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Tome of Clear Thought",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "Another magical tome. Studying this book for 48 hours (over no more than 6 days) increases your Intelligence score by 2, and your maximum for that score by 2. The tome then loses its magic for 100 years",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Tome of Leadership and Influence",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "A tome that can refine one’s force of personality. If you spend 48 hours over ≤6 days studying it, your Charisma score increases by 2, and your maximum for that score increases by 2. The tome then becomes blank for a century",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Tome of the Stilled Tongue",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "A sinister spellbook said to be made from the tongue of a treacherous spellcaster. While attuned (must be a wizard), you can use an action to cast any spell inscribed in this tome without speaking its verbal component and without expending a spell slot, once per day. However, each time you do so, there is a cumulative chance that the tome exacts a price (like temporarily preventing you from speaking or other curses). This tome often contains many spells and serves as a spellbook as well. It is a dangerous but coveted item for wizards",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Tome of Understanding",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": false,
      "description": "Yet another magical tome. Studying it for 48 hours (within 6 days) increases your Wisdom score by 2, and your maximum for Wisdom by 2. The tome then loses its magic for 100 years",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Trident of Fish Command",
      "category": "Weapon",
      "rarity": "uncommon",
      "attunement": true,
      "description": "A magic trident that grants the ability to control fish. It has 3 charges. While attuned, you can expend 1 charge to cast **Dominate Beast** (save DC 15) but only on beasts that have an innate swimming speed (i.e., aquatic creatures). The trident regains 1d3 charges daily at dawn",
      "spells": [
        "Dominate Beast"
      ],
      "publication": "SRD"
    },
    {
      "name": "Unbreakable Arrow",
      "category": "Weapon",
      "rarity": "common",
      "attunement": false,
      "description": "This arrow is magically reinforced. It cannot be broken, except when inside an antimagic field (in which case it becomes mundane and could be snapped). Otherwise, it always remains intact, allowing for reuse",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Universal Solvent",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": false,
      "description": "A thick, clear liquid in a jar. When applied to any substance (an object, adhesive, etc.), it immediately dissolves it. For instance, one dose of universal solvent will instantly and safely dissolve Sovereign Glue or any adhesive, as well as other organic or inorganic materials. It’s extremely rare and valuable for removing curses or sticky predicaments",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Veteran's Cane",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "An ornate walking cane that conceals a hidden blade. You can speak a command word to transform it into a +1 longsword. The first time you hit with the sword, it deals an extra 1d4 damage (this is the cane’s only magical effect). After one use, the cane’s magic fades to just being a normal cane with a sword inside",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Vicious Weapon",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": false,
      "description": "A magic weapon that punishes foes on critical hits. When you roll a 20 on an attack roll with this weapon, it deals an additional 7 damage of the weapon’s type to the target. (There is no bonus on non-critical hits)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Vorpal Sword",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "A +3 enchanted sword of unparalleled sharpness. On a roll of 20 (critical hit) against a creature that has a head, the sword cuts off that head, instantly killing the creature. A creature immune to slashing damage or too large for decapitation (GM’s call) instead takes an extra 6d8 slashing damage. The sword cannot sever heads of certain creatures (like many undead, golems, etc. that lack vulnerable necks). Otherwise, this is one of the deadliest blades in existence",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Walloping Ammunition",
      "category": "Weapon",
      "rarity": "common",
      "attunement": false,
      "description": "A piece of magic ammunition (arrow, bolt, etc.) that packs extra punch. If this ammo hits a target, the target must succeed on a DC 10 Strength save or be knocked **prone**. After striking, the ammo is no longer magical (and likely destroyed or lost as normal)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wand of Binding",
      "category": "Wand",
      "rarity": "rare",
      "attunement": true,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend charges to cast **Hold Monster** (5 charges, save DC 17) or **Hold Person** (2 charges, save DC 17). Additionally, you can use a reaction when you would be grappled or restrained to expend 1 charge and gain advantage on any saving throw or check to avoid being restrained. The wand regains 1d6+1 charges at dawn. If you expend the last charge, roll d20; on a 1, the wand crumbles into dust",
      "spells": [
        "Hold Monster",
        "Hold Person"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Conducting",
      "category": "Wand",
      "rarity": "common",
      "attunement": false,
      "description": "This wand has 3 charges. As an action, you can expend 1 charge to create orchestral music that only you (and creatures you choose within 30 ft) can hear. The music plays for 1 minute. Essentially, it allows you to conduct an invisible orchestra for dramatic effect. The wand regains all charges at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wand of Enemy Detection",
      "category": "Wand",
      "rarity": "rare",
      "attunement": true,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 charge and make it pulse with warning. For the next minute, the wand points toward the nearest creature hostile to you within 60 feet (if any are present). The wand can sense shapechangers or creatures disguised by magic. The wand regains 1d6+1 charges each dawn. If you expend the last charge, roll d20; on a 1, it becomes a nonmagical stick",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wand of Fear",
      "category": "Wand",
      "rarity": "rare",
      "attunement": true,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 2 charges to cast **Fear** (save DC 15). Alternatively, you can expend 1 charge and command one creature to flee (functioning like the command “Flee” from the **Command** spell, DC 15). The wand regains 1d6+1 charges daily at dawn. If the last charge is expended, roll d20; on a 1, the wand crumbles into ash",
      "spells": [
        "Fear"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Fireballs",
      "category": "Wand",
      "rarity": "rare",
      "attunement": true,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 or more charges to cast the **Fireball** spell (save DC 15) from it. For 1 charge, it’s a 3rd-level Fireball (8d6 fire). You can increase the spell slot level by one for each additional charge expended. The wand regains 1d6+1 charges each dawn. If you expend the last charge, roll d20; on a 1, the wand erupts in flames and is destroyed",
      "spells": [
        "Fireball"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Lightning Bolts",
      "category": "Wand",
      "rarity": "rare",
      "attunement": true,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 or more charges to cast **Lightning Bolt** (save DC 15) from it. For 1 charge, it’s cast at 3rd level (8d6 lightning). Each additional charge increases the spell’s level by one. The wand regains 1d6+1 charges at dawn. If you expend the last charge, roll d20; on a 1, the wand splits with a crack of thunder and is destroyed",
      "spells": [
        "Lightning Bolt"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Magic Detection",
      "category": "Wand",
      "rarity": "uncommon",
      "attunement": false,
      "description": "This wand has 3 charges. While holding it, you can expend 1 charge as an action to cast **Detect Magic**. The wand regains 1d3 charges daily. If you expend the last charge, roll d20; on a 1, it disintegrates into fine dust",
      "spells": [
        "Detect Magic"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Magic Missiles",
      "category": "Wand",
      "rarity": "uncommon",
      "attunement": false,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 or more charges to cast the **Magic Missile** spell from it. For 1 charge, you cast it at 1st level (3 darts). You can increase the spell slot by one for each additional charge expended. The wand regains 1d6+1 charges daily. If you expend the last charge, roll d20; on a 1, it crumbles into powder",
      "spells": [
        "Magic Missile"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Orcus",
      "category": "Wand",
      "rarity": "artifact",
      "attunement": true,
      "description": "A dread artifact: the skull-topped wand wielded by the demon lord Orcus. It’s imbued with immense necromantic power and unspeakable evil:contentReference[oaicite:7]{index=7}:contentReference[oaicite:8]{index=8}. It functions as a +3 mace that deals extra necrotic damage. While attuned, you can cast *Power Word Kill*, *Finger of Death*, *Circle of Death*, and many other death-related spells from it. Any undead around you gain additional resilience. However, the wand also has a curse of soul-devouring: any humanoid killed by it rises as a zombie under Orcus’s control. The wand is sentient and seeks to spread death. It can also summon undead and has many other horrific abilities. Only by divine intervention can it be destroyed. (Note: This is one of the most dangerous evil artifacts in D&D)",
      "spells": [
        "Power Word Kill",
        "Finger of Death",
        "Circle of Death"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Paralysis",
      "category": "Wand",
      "rarity": "rare",
      "attunement": true,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 charge and fire a paralyzing ray at a creature within 60 feet. The target must make a DC 15 Constitution save or be paralyzed for 1 minute. The target can repeat the save at end of each turn. The wand regains 1d6+1 charges each day. If you expend the last charge, roll d20; on a 1, the wand becomes a nonmagical stick",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wand of Polymorph",
      "category": "Wand",
      "rarity": "very rare",
      "attunement": true,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 charge to cast **Polymorph** (save DC 15). The wand regains 1d6+1 charges daily at dawn. If the last charge is expended, roll d20; on a 1, it transforms into a random tiny creature and scampers away, forever lost (i.e., destroyed in a whimsical fashion)",
      "spells": [
        "Polymorph"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Pyrotechnics",
      "category": "Wand",
      "rarity": "common",
      "attunement": false,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 charge to create a harmless burst of multicolored light at a point you can see up to 60 feet away. The burst is like a small firework: it emits bright light (20 ft) and dim light (another 20 ft) and a crackling sound. The lights linger for a second. The wand regains 1d6+1 charges at dawn. If you expend the last charge, roll d20; on a 1, it pops into a cloud of sparkling smoke and is gone",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wand of Scowls",
      "category": "Wand",
      "rarity": "common",
      "attunement": false,
      "description": "This wand has 3 charges. As an action, you can expend 1 charge to target a humanoid you can see within 30 feet. The target must succeed on a DC 10 Charisma save or its face is forced into a scowl for 1 minute. The effect is purely cosmetic and doesn’t harm the target (though it might affect social interactions). The wand regains all charges daily at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wand of Secrets",
      "category": "Wand",
      "rarity": "uncommon",
      "attunement": false,
      "description": "This wand has 3 charges. While holding it, you can use an action to expend 1 charge. If there is a secret door or trap within 30 feet of you, the wand pulses and points at the one nearest to you. The wand regains 1d3 charges at dawn",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wand of Smiles",
      "category": "Wand",
      "rarity": "common",
      "attunement": false,
      "description": "This wand has 3 charges. You can use an action to expend 1 charge, targeting a humanoid within 30 feet. The target must succeed on a DC 10 Charisma save or be forced to smile for 1 minute. The effect is harmless (just a goofy grin). The wand regains all charges at dawn. If the last charge is used, roll d20; on a 1, the wand transforms into a small hand mirror that makes whoever looks in it smile",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wand of the War Mage, +X",
      "rarity": "varies",
      "category": "Wand",
      "attunement": "Requires attunement by a spellcaster",
      "is_consumable": false,
      "formula_source": "DMG 2014",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "DMG 2014",
      "aliases": [],
      "notes": "",
      "variants": [
        {
          "name": "Wand of the War Mage, +1",
          "rarity": "uncommon"
        },
        {
          "name": "Wand of the War Mage, +2",
          "rarity": "rare"
        },
        {
          "name": "Wand of the War Mage, +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Web",
      "category": "Wand",
      "rarity": "uncommon",
      "attunement": true,
      "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 charge to cast **Web** (save DC 15). The wand regains 1d6+1 charges at dawn. If you expend the last charge, roll d20; on a 1, the wand dissolves into sticky spiderwebs",
      "spells": [
        "Web"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wand of Wonder",
      "category": "Wand",
      "rarity": "rare",
      "attunement": true,
      "description": "A chaotic wand with 7 charges. When you use an action to expend 1 charge, it produces a random magical effect. Possible effects include: stream of butterflies, a burst of flowers, **Lightning Bolt**, **Slow**, **Enlarge** self, **Grass** grows, **Gust of Wind**, gems spray, etc., determined by a d100 roll on a provided table:contentReference[oaicite:9]{index=9}:contentReference[oaicite:10]{index=10}. The results can be beneficial or odd. The wand regains 1d6+1 charges at dawn. If the last charge is expended, roll d20; on a 1, it crumbles into dust",
      "spells": [
        "Lightning Bolt",
        "Slow",
        "Gust of Wind"
      ],
      "publication": "SRD"
    },
    {
      "name": "Weapon, +X",
      "rarity": "varies",
      "category": "Weapon",
      "attunement": false,
      "is_consumable": false,
      "formula_source": "DMG 2014",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "DMG 2014",
      "aliases": [
        "+1 weapon",
        "+2 weapon",
        "+3 weapon"
      ],
      "notes": "Choose any weapon.",
      "variants": [
        {
          "name": "Weapon, +1",
          "rarity": "uncommon"
        },
        {
          "name": "Weapon, +2",
          "rarity": "rare"
        },
        {
          "name": "Weapon, +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Weapon of Warning",
      "category": "Weapon",
      "rarity": "uncommon",
      "attunement": true,
      "description": "Any weapon (usually a sword) with a minor enchantment that vibrates to warn of danger. While attuned and the weapon is on your person, you have advantage on initiative rolls. Additionally, you and your allies within 30 feet cannot be surprised, except when incapacitated by something other than nonmagical sleep. The weapon magically awakens you and your companions when combat begins (if you were sleeping naturally)",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Well of Many Worlds",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": false,
      "description": "A silk handkerchief that unfolds into a 6-foot diameter circular cloth. When spread on the ground, it creates a two-way portal to another world or plane of existence. Each time it is activated (unfurled), it connects to a random plane (or location determined by the GM). Creatures or objects that go through disappear into that plane. The well is a one-of-a-kind and unpredictable item; it closes when picked up (or if half is folded onto the other). It can be used for escape or banishment, but one never knows what alien realm it will lead to next",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Whelm",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "Whelm is a sentient +3 warhammer once wielded by a dwarven hero. It has the thrown property (range 20/60) and returns to the wielder’s hand. It deals an extra 1d8 thunder damage to giants. Once per day, it can be struck against the ground to create a shock wave (as **Thunderwave**, DC 15). It can also detect the presence of evil creatures or precious metals. However, Whelm has a strong personality: it seeks to slay goblins and giants above all, and it demands that its wielder carry no other weapons. Its attunement can conflict if the user doesn’t align with its goals (like leaving a fight with giants). It also causes its wielder to become obsessed with treasure. Overall, it’s a powerful but willful artifact",
      "spells": [
        "Thunderwave",
        "Detect Evil and Good",
        "Locate Object"
      ],
      "publication": "SRD"
    },
    {
      "name": "Wind Fan",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A folding hand-fan painted with images of gusting clouds. While holding it, you can use an action to cast **Gust of Wind** (DC 13). The fan can be used this way up to 3 times per day. Each use beyond the first has a cumulative 20% chance of tearing the fan, rendering it nonmagical and unusable. If not overused, it regains all uses at dawn",
      "spells": [
        "Gust of Wind"
      ],
      "publication": "SRD"
    },
    {
      "name": "Winged Boots",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "A pair of boots with small wings at the ankles. While wearing them, you have a flying speed equal to your walking speed. You can fly up to 4 hours total (all at once or in shorter flights of at least 1 minute). If you exceed 4 hours, the boots cease to function until they have rested (1 hour of rest per 2 hours of flying). They regain 2 hours of flying capability for every 12 hours they aren’t in use. If you are airborne when the duration expires, you float gently to the ground",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Wings of Flying",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "A cape or cloak that, on command, transforms into a pair of bat or bird-like wings. While the wings are present, you gain a flying speed of 60 feet. The wings last for up to 1 hour per use, and the effect can be used once before requiring a rest (it resets at dawn). When the wings vanish (or if you dismiss them as a bonus action), the cloak returns to normal. If you’re flying when the duration ends, you descend slowly for 1 minute (as with Feather Fall) before the magic dissipates",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "All-Purpose Tool, +X",
      "rarity": "varies",
      "category": "Wondrous item",
      "attunement": "Requires attunement by an artificer",
      "is_consumable": false,
      "formula_source": "TCoE 2020",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "Tasha’s Cauldron of Everything",
      "aliases": [],
      "notes": "",
      "variants": [
        {
          "name": "All-Purpose Tool +1",
          "rarity": "uncommon"
        },
        {
          "name": "All-Purpose Tool +2",
          "rarity": "rare"
        },
        {
          "name": "All-Purpose Tool +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Amulet of the Devout, +X",
      "rarity": "varies",
      "category": "Wondrous item",
      "attunement": "Requires attunement by a cleric or paladin",
      "is_consumable": false,
      "formula_source": "TCoE 2020",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "Tasha’s Cauldron of Everything",
      "aliases": [],
      "notes": "",
      "variants": [
        {
          "name": "Amulet of the Devout +1",
          "rarity": "uncommon"
        },
        {
          "name": "Amulet of the Devout +2",
          "rarity": "rare"
        },
        {
          "name": "Amulet of the Devout +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Arcane Grimoire, +X",
      "rarity": "varies",
      "category": "Wondrous item",
      "attunement": "Requires attunement by a wizard",
      "is_consumable": false,
      "formula_source": "TCoE 2020",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "Tasha’s Cauldron of Everything",
      "aliases": [],
      "notes": "",
      "variants": [
        {
          "name": "Arcane Grimoire +1",
          "rarity": "uncommon"
        },
        {
          "name": "Arcane Grimoire +2",
          "rarity": "rare"
        },
        {
          "name": "Arcane Grimoire +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Bloodwell Vial, +X",
      "rarity": "varies",
      "category": "Wondrous item",
      "attunement": "Requires attunement by a sorcerer",
      "is_consumable": false,
      "formula_source": "TCoE 2020",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "Tasha’s Cauldron of Everything",
      "aliases": [],
      "notes": "",
      "variants": [
        {
          "name": "Bloodwell Vial +1",
          "rarity": "uncommon"
        },
        {
          "name": "Bloodwell Vial +2",
          "rarity": "rare"
        },
        {
          "name": "Bloodwell Vial +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Moon Sickle, +X",
      "rarity": "varies",
      "category": "Weapon",
      "attunement": "Requires attunement by a druid or ranger",
      "is_consumable": false,
      "formula_source": "TCoE 2020",
      "formula_type": "enchant",
      "special_components": [],
      "gp_overrides": null,
      "time_overrides": null,
      "source": "Tasha’s Cauldron of Everything",
      "aliases": [],
      "notes": "",
      "variants": [
        {
          "name": "Moon Sickle +1",
          "rarity": "uncommon"
        },
        {
          "name": "Moon Sickle +2",
          "rarity": "rare"
        },
        {
          "name": "Moon Sickle +3",
          "rarity": "very_rare"
        }
      ],
      "publication": "SRD"
    },
    {
      "name": "Rhythm-Maker's Drum",
      "category": "Wondrous item",
      "rarity": "varies",
      "attunement": true,
      "description": "A finely-crafted drum granting a bonus (+1 to +3) to spell attack rolls and save DCs for bards. If attuned, you regain one use of Bardic Inspiration after a long rest.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Guardian Emblem",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "A holy symbol that can be affixed to a shield. It has 3 charges. When you or an ally within 30 ft suffers a critical hit, you can use your reaction to expend a charge to turn that critical hit into a normal hit. The emblem regains all charges at dawn.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Devotee's Censer",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "A flail that doubles as a thurible (incense burner). It deals an extra 1d8 radiant damage on a hit. While attuned, as an action once per day you can cause fragrant healing smoke to billow out: all allies within 10 ft heal 1d4 + 1 hit points.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Baba Yaga's Mortar and Pestle",
      "category": "Wondrous item",
      "rarity": "artifact",
      "attunement": true,
      "description": "This artifact consists of a large mortar (bowl) and pestle. It can expand in size to carry you and up to 3 others, flying through the air at high speed. It can plane shift to other realms associated with Baba Yaga. It can also grind materials (like creatures or magical herbs) to produce potions or effects. The Mortar and Pestle are sentient and extremely powerful, often with unique effects and a degree of unpredictability, tied intimately to the legendary witch Baba Yaga.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Absorbing Tattoo",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "A tattoo that grants resistance to a specific damage type (chosen when applied). When you take damage of that type, you can use your reaction to gain immunity to that instance of damage and regain hit points equal to half the damage absorbed (once per dawn).",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Barrier Tattoo",
      "category": "Wondrous item",
      "rarity": "varies",
      "attunement": true,
      "description": "A tattoo that manifests as protective patterns on your skin. While you aren’t wearing armor, it gives you an AC based on its rarity: Uncommon (AC 12 + Dex mod), Rare (AC 15 + Dex mod, max +2), Very Rare (AC 18).",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Blood Fury Tattoo",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "A red ink tattoo representing fury in battle (10 charges). When you hit a creature, you can expend a charge to deal an extra 4d6 necrotic and gain that much HP (as healing). When you take damage, you can use a reaction and expend a charge to make a melee attack with advantage against the attacker on your next turn. The tattoo regains all charges at dawn.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Coiling Grasp Tattoo",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "An ink tattoo of spiraling vines or tentacles. As an action, you can force a creature within 15 ft to make a DC 14 Strength save or take 3d6 piercing damage and be grappled (escape DC 14). The effect ends if you stop it or the creature escapes.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Eldritch Claw Tattoo",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "A tattoo of claw-like marks. Your unarmed strikes count as magical and get +1 to hit and damage. As a bonus action once per day, you can empower the tattoo for 1 minute: your melee attacks gain a 15-foot reach as spectral claws lash out, and they deal +1d6 force damage on a hit.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Ghost Step Tattoo",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "An ethereal-themed tattoo (3 charges). As a bonus action, you can expend 1 charge to become incorporeal until the end of your turn. While ghostly, you have resistance to all damage except force, and you can move through creatures and objects (taking 1d10 force if you end inside one). Regains all charges at dawn.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Illuminator's Tattoo",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A tattoo of ink and calligraphy. You can touch a piece of writing up to one page and cause it to become invisible to everyone except you and those you designate for 24 hours. Also, as an action, you can cause your fingertip to act as an ink pen that writes in any color ink (or magically writes on a surface) for you, even while you aren’t touching a surface.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Lifewell Tattoo",
      "category": "Wondrous item",
      "rarity": "very rare",
      "attunement": true,
      "description": "A tattoo showing symbols of life and warding off death. If you would drop to 0 HP, you instead drop to 1 HP and the tattoo deactivates this effect until the next dawn. Also, you have advantage on death saving throws while tattooed.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Masquerade Tattoo",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A shifting, colorful tattoo. You can use an action to change the tattoo’s appearance and location on your body. Additionally, you can cast **Disguise Self** from it once per day (DC 13) to change your overall appearance for 1 hour.",
      "spells": [
        "Disguise Self"
      ],
      "publication": "SRD"
    },
    {
      "name": "Shadowfell Brand Tattoo",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "A dark, smoky tattoo. When you take damage, you can use your reaction to become shadowy and insubstantial until the start of your next turn. In that state, you have resistance to all damage. Once used, this property can’t be used again until you finish a short or long rest. Also, you gain darkvision 60 ft if you don’t have it, and advantage on Stealth checks at night.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Spellwrought Tattoo",
      "category": "Wondrous item",
      "rarity": "varies",
      "attunement": false,
      "description": "A tattoo imbued with a single spell (determined at creation). It acts like a one-use scroll on your skin. You can cast the spell once from the tattoo, without needing components. The spell’s level determines the tattoo’s rarity (1st level Common, 2nd Uncommon, 3rd Rare, 4th Very Rare, 5th or higher Legendary). After you cast the spell, the tattoo’s magic fades away.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dragonhide Belt",
      "category": "Wondrous item",
      "rarity": "varies",
      "attunement": true,
      "description": "A belt made of dragon hide, favored by monks. It grants a bonus (+1 to +3 depending on rarity) to the saving throw DC of your Ki features (like Stunning Strike). Additionally, when you use Step of the Wind, you can recover a number of hit points equal to your proficiency bonus (once per day).",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Dragonlance",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "A fabled lance infused with draconic power. It is a +3 lance that deals an extra 3d6 radiant damage to dragons. Allied creatures within 30 ft of you gain advantage on saving throws against a dragon’s Frightful Presence. In the hands of a dragon-rider or hero of destiny, it can turn the tide of a battle with a dragon.",
      "spells": null,
      "publication": "SRD"
    },
    {
      "name": "Dragon's Wrath Weapon",
      "category": "Weapon",
      "rarity": "varies",
      "attunement": true,
      "description": "A weapon infused with the essence of a dragon’s wrath. It’s a +1 to +3 weapon depending on rarity. It deals extra damage of the dragon’s type (e.g., +1d6 fire for red dragon) on a hit. On a critical hit, the target and creatures around it take additional damage of that type (as a small burst of draconic energy).",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Gold Canary Figurine of Wondrous Power",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "This magical figurine can become a Giant Canary which then transforms into a Gold Dragon Wyrmling for up to 1 hour. The dragon wyrmling is friendly to you and can fight on your behalf. After it reverts to figurine form, it can’t be used again until 7 days have passed.",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Topaz Annihilator",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "A rare experimental firearm crafted with topaz dragon shards. This magical ranged weapon fires a line of crackling energy. It deals 2d12 piercing + 2d6 necrotic damage on a hit. If it reduces an undead to 0 HP, that undead is disintegrated. It ignores the loading property (no reload time). Ammunition is a special crystal charge. It’s a powerful yet unstable weapon from an advanced society.",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Technically \"Plate\" Armor",
      "category": "Armor",
      "rarity": "common",
      "attunement": false,
      "description": "A gag armor set made by strapping actual metal plates (from a kitchen) onto oneself. It provides AC similar to plate armor (AC 18) but is extremely brittle. If you take a critical hit while wearing this, the armor’s AC is reduced by 1 as plates shatter. It’s an impractical, humorous creation born of desperation.",
      "spells": null,
      "publication": "homebrew"
    },
    {
      "name": "Dryad's Gift",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": true,
      "description": "A +2 longbow crafted from a living tree branch by a grateful dryad. It requires no arrows — when drawn, it magically forms an arrow from nearby plant material. While attuned, you have advantage on Stealth checks in forests and can communicate simple ideas to plants. Once per day, you can touch a tree and send a short message through the forest that is delivered by rustling leaves to a creature you designate in the same forest.",
      "spells": null,
      "publication": "homebrew"
    },
    {
      "name": "Fine Mustache",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "A dapper fake mustache. When applied, it magically adheres. While wearing it, your Charisma increases by 1 (to a max of 20) for purposes of polite social interactions, and you have advantage on Persuasion checks to appear distinguished. However, if someone attempts to forcibly remove the mustache, it lets out a squeaky protest.",
      "spells": null,
      "publication": "homebrew"
    },
    {
      "name": "Relentless Stinger",
      "category": "Weapon",
      "rarity": "rare",
      "attunement": false,
      "description": "A rapier with a wasp-themed hilt. It’s a +1 weapon. When you score a killing blow on a creature with this rapier, you gain a +2 bonus to damage on your next attack with it (within 1 minute). This effect stacks if you quickly finish off multiple foes, but resets if a minute passes with no kills.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Blade of the Unbroken Circle",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "A longsword +2 grown from an ancient treant’s branch. Druids can wield it as a focus. It grants +2 to attack/damage. If you’re an elf or druid, it’s especially potent: you can use Wisdom instead of Strength to attack. It has 10 charges and regains 1d6+4 at dawn (full for druids). You can expend charges to cast spells (DC 17): 2 for **Barkskin**, 3 for **Plant Growth**, 5 for **Tree Stride**, 6 for **Wall of Thorns**, 7 for **Regenerate**. On a hit, you can expend 1 charge to deal +2d6 bonus damage of a type reflecting the terrain (e.g., in forest, slashing from brambles; in swamp, poison).",
      "spells": [
        "Barkskin",
        "Plant Growth",
        "Tree Stride",
        "Wall of Thorns",
        "Regenerate"
      ],
      "publication": "homebrew"
    },
    {
      "name": "Arkanobow",
      "category": "Weapon",
      "rarity": "very rare",
      "attunement": true,
      "description": "A high-tech longbow hilt with no bow arms. As a bonus action, you can speak a command to make pure energy limbs appear, turning it into a functional longbow of crackling energy. It’s a +2 weapon. If you draw it without an arrow, it creates a lightning bolt arrow that deals lightning damage on hit instead of piercing. Against metal-armored targets, you have advantage on the attack. The bow’s energy source lasts 60 minutes total. You can recharge it by feeding spell slots into it (1 slot level = +1 minute). While attuned, you can spend extra energy (minutes of charge) to perform stunts like firing an explosive arrow (cost 5 minutes) or making a “jump shot” teleport to where your arrow lands (cost 10 minutes). If it runs out of power mid-flight, the limbs vanish but you safely glide to the ground.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Blazeblood Signet",
      "category": "Ring",
      "rarity": "very rare",
      "attunement": true,
      "description": "A dark metal ring set with a blood-red gem that feels warm. While wearing it, you have resistance to cold damage and you regain all spent Hit Dice on a long rest. When you spend Hit Dice during a short rest, you regain maximum value. Additionally, when you hit a creature, you can choose to spend up to 5 of your Hit Dice. You gain temporary HP equal to half the total rolled (rounded up), and that creature takes an equal amount of fire damage. However, the ring is cursed: any magical healing you receive is halved in its effect.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Holy Symbol of Ravenkind",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "Platinum sunburst holy symbol holding 10 charges. Can emit sunlight, hinder or paralyze vampires, and empower Turn Undead (recharges daily).",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Sunsword",
      "category": "Weapon",
      "rarity": "legendary",
      "attunement": true,
      "description": "Sentient sun blade (shortsword). Deals radiant damage, extra vs. undead, sheds bright sunlight on command.",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Icon of Ravenloft",
      "category": "Wondrous item",
      "rarity": "legendary",
      "attunement": true,
      "description": "Ancient silver icon. Bolsters healing magic, harms fiends/undead with holy radiance once per dawn.",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Bottle of Boundless Coffee",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "Self-refilling coffee flask that pours hot coffee all day (limited flow).",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Dragon Vessel",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": false,
      "description": "Stoppered drinkware with draconic motifs. Once per day, transforms up to a pint of liquid into a chosen beverage or clean water; can warm/cool contents.",
      "spells": null,
      "publication": "official_non_srd"
    },
    {
      "name": "Cabal's Ruin",
      "category": "Wondrous item",
      "rarity": "artifact",
      "attunement": true,
      "description": "(Vestige, Dormant) Cloak that absorbs some spell energy and can release it as lightning; grows in power when Awakened/Exalted.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Deathwalker's Ward",
      "category": "Armor",
      "rarity": "artifact",
      "attunement": true,
      "description": "(Vestige, Dormant) Raven-themed armor; grants defensive boons and bolsters death saves; stronger forms add necrotic resist and flight.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Fenthras",
      "category": "Weapon",
      "rarity": "artifact",
      "attunement": true,
      "description": "(Vestige, Dormant) Legendary longbow; +1 with minor extra lightning damage; higher states add greater power.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Spire of Conflux",
      "category": "Weapon",
      "rarity": "artifact",
      "attunement": true,
      "description": "(Vestige, Dormant) Blue crystal staff; +1 and minor spellcasting aid; later gains charges to cast stronger spells.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Titanstone Knuckles",
      "category": "Wondrous item",
      "rarity": "artifact",
      "attunement": true,
      "description": "(Vestige, Dormant) Massive gauntlets; grant ogre-like strength and boosted unarmed strikes; improve greatly as they awaken.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Whisper",
      "category": "Weapon",
      "rarity": "artifact",
      "attunement": true,
      "description": "(Vestige, Dormant) Dark dagger; +1 with necrotic bite; higher forms gain recall/teleport and stealthy slaying.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Boots of the Vigilant",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "Sense danger; after rolling initiative, add +1d8 once per day; wearing them helps you avoid being surprised.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Stormrider Boots",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "Once per short rest, burst of flight for a round; passing foes take minor lightning damage; OAs vs you have disadvantage.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Raven's Slumber",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "Crystal that can store a willing creature in safe stasis or (on hit, save negates) trap an unwilling creature; one creature at a time.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Cataclysm Bolts",
      "category": "Ammunition",
      "rarity": "uncommon",
      "attunement": false,
      "description": "Set of 10 crossbow bolts; each triggers a random elemental blast on hit; the bolt is destroyed after impact.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Earthboard",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "Stone 'board' for earth-gliding; grants burrow-like movement and lets you perform a shockwave landing once per short rest.",
      "spells": null,
      "publication": "third_party"
    },
    {
      "name": "Skysail",
      "category": "Wondrous item",
      "rarity": "uncommon",
      "attunement": true,
      "description": "Wearable glider; you can safely glide; 3 charges to cast fly on yourself for 1 minute; regains charges at dawn.",
      "spells": [
        "Fly"
      ],
      "publication": "third_party"
    },
    {
      "name": "Dagger of Many Daggers",
      "category": "Weapon",
      "rarity": "uncommon",
      "attunement": false,
      "description": "+1 dagger with 1/day ability to cast Cloud of Daggers (modest DC); visual effect of splitting into spectral blades.",
      "spells": [
        "Cloud of Daggers"
      ],
      "publication": "homebrew"
    },
    {
      "name": "Bag of Wondrous Randomization",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "Once per day, place an object inside to trigger a random magical effect from a wild d100 table; unpredictable outcomes.",
      "spells": null,
      "publication": "homebrew"
    },
    {
      "name": "Flask of Perpetual Booze",
      "category": "Wondrous item",
      "rarity": "common",
      "attunement": false,
      "description": "Ever-filling liquor flask; can pour ale, wine, or spirits of average quality indefinitely.",
      "spells": null,
      "publication": "homebrew"
    },
    {
      "name": "Brooch des Fleurs",
      "category": "Wondrous item",
      "rarity": "rare",
      "attunement": true,
      "description": "Floral brooch with five magical petals; expend a petal for a themed effect (charm, heal, illusion, etc.); regrows one petal at dawn.",
      "spells": null,
      "publication": "homebrew"
    }
  ]
}