[
     {
          "year": "-50000*",
          "title": "The Primordials exist",
          "details": "The Vekya or Primordials are belched into being by the universe.",
          "expanded_html": true,
          "expanded": "Beneath the obsidian veil of eternity, an endless astral sea sprawled — a blackened abyss that swallowed all light and hope. It was a void eternal and unmoving, where silence rotted in the bones of time. Yet, from the crushing depths of that dead stillness, an ember flickered to life. The abyss flared with a blaze — flames that burned with a hellish coldness, both scalding and frozen. <br><br>That cosmic fire raged, consuming the astral sea in its grasp. The fragile weave of the cosmos tore apart, cracking like shattered bone under an ethereal force. Splintered into countless jagged shards, the universe bled fragments into the dark expanse. Each shard, a realm cast into its own shadowed corner of time and space — birthplaces of realms both cursed and blessed, the fractured planes of existence. <br><br>For an age, the planes roared with untamed fury — flames of creation and chaos alike — but eventually, the fire began to fade. From its embers arose stars, worlds, and places of great power. And from those places, the first gods emerged: the <strong>Vekya</strong>, or <strong>Primordials</strong>."
     },
     {
          "year": "-50000*",
          "title": "Uzume creates the Annarr and Annarr-kin",
          "details": "Using her essence, Uzume creates the Annarr and Annar-kin to carry out her will. The Annarr are the first gods, each served by what could be best termed a familiar or Annarr-kin.",
          "expanded_html": true,
          "expanded": "<strong>Uzume</strong> was alone, for both <strong>Kronos</strong> and and <strong>Kaos</strong> were relentless and unwavering in their task. Lonely in her divinity, <strong>Uzume</strong> tore a piece from her own essence and formed wondrous beings to accompany her and carry out her will across the multiverse. These were the <strong>Annarr</strong> and their companions, the <strong>Annarr-kin</strong>. The <strong>Annarr</strong> were gods in their own right — mighty and strange. The <strong>Annarr-kin</strong>, though formidable, fell short of godhood, and could, perhaps, be considered to be Familiars of a sort."
     },
     {
          "year": "-50000*",
          "title": "Fafnirog slays Uzume",
          "details": "Kaos and Kronos, bitter and jealous, conspire to Uzume. They enter a pact with the great void wyrm, Fafnirog, who slays Uzume in exchange for Godhood.",
          "expanded_html": true,
          "expanded": "Seeing Uzume’s creations, <strong>Kaos</strong> and <strong>Kronos</strong> grew bitter. Jealousy poisoned their thoughts, and they conspired to steal her power. Yet some cosmic force forbade them from harming her directly. So they turned to the <strong>Annarr</strong> and <strong>Annarr-kin</strong>. None would join them — save one.<br><br> The Great Dragon <strong>Fafnirog</strong>, devourer of light, who slumbered in the darkest voids, accepted their offer. In return for his betrayal, he would be granted the power of a god.<br><br><strong>Kaos</strong> and <strong>Kronos</strong> lured <strong>Uzume</strong> to the <strong>Celestial Forge</strong>, where the first spark had been born. There, hidden in shadow, <strong>Fafnirog</strong> struck. He tore her open and scattered her essence."
     },
     {
          "year": "-10000",
          "title": "Ascent from darkness",
          "details": "The first Dark Elves emerge from the Underworld and are given the gift of Everlight by Aeter. Age of The Sun begins.",
          "epoch": true,
          "expanded_html": true,
          "expanded": "This is the fully expanded version of the event in question."
     },

     {
          "year": "-9900",
          "title": "The Shattering of the Veil",
          "details": "A rift briefly tears open between Skazka and the Shadow Realm. Through it pour creatures of fractured glass and smoke, remembered in folk tales as the Mirrormen. They vanish as swiftly as they appear."
     },
     {
          "year": "-9800",
          "title": "Rise of Kaijistan",
          "details": "The Kingdom is formed when the nomadic tribes of the region agree to unite under a single ruler.."
     },
     {
          "year": "-9500",
          "title": "The Pact of Everlight",
          "details": "a conclave of elf seers binds themselves to keep its flame eternal. A rite is performed that binds their life essence to its protection. They become Ember wraiths - never alive nor dead. Bound to a single purpose - protect the Everlight."
     },
     {
          "year": "-8500",
          "title": "Founding of Velkaria",
          "details": "The Jewel of Kaijistan rises on the banks of a river. Legends claim its throne was forged from a fallen starstone, and that every ruler since slowly grew violet-eyed from its touch."
     },
     {
          "year": "-3300",
          "title": "The Pact of Blood and Thorn",
          "details": "A forgotten Annarr-kin, Veythra the Thorn-Mother, strikes a bargain with a small group of Elves. Their rites are quickly outlawed and those involved banished. Her cult survives in hidden corners of the world, blamed for the cursed brambles that still strangle ruined villages."
     },
     {
          "year": "-3000",
          "title": "Divergence",
          "details": "Over next thousand years groups of Sun Elves migrate. The largest group travels south and founds Everdusk, and over time they become  the Wood Elves. Others travel east beyond the mountains and are  never seen nor heard of again."
     },
     {
          "year": "-2700",
          "title": "Temple of Sinari constructed",
          "details": "To honour and protect the gift of Everlight, the Dark Elves build the Temple of Sinari in the cave from which they first emerged from the darkness of the Underworld."
     },
     {
          "year": "-2800",
          "title": "Kitezh sacked",
          "details": "Dwarves rebel against their overlord and sack the city of Kitezh. They set out into the darkness to forge their own fate."
     },
     {
          "year": "-1800",
          "title": "Nav'Golam founded",
          "details": "The dwarves, having wondered the Underworld for centuries, finally find a place to call home. They build the great underground city of Nav'Golam."
     },
     {
          "year": "-1800",
          "title": "Nav'Cherom founded",
          "details": "The Dwarves, rich with the minerals mined from around Nav'Golam, construct the second city of Nav'Cherom."
     },
     {
          "year": "-1700",
          "title": "The Orcs arrive on Skazka",
          "details": "Hundreds of Orcs are brought to Skazka by the god Chernabog. They settle in the arid east - an area known as the Ghost Lands."
     },
     {
          "year": "-1700",
          "title": "The Fading",
          "details": "An era defining moment when magic permanency began to fail.",
          "expanded_html": true,
          "expanded": "Scholars and historians can never agree on what caused The Fading. Some point to the arrival of the Orcs while others somehow link it to the Draconic slumber. In any event, this fracture in the weave of magic began nearly two millennia ago. Arms and armour—once vibrant with rune and incantation—started to dull. Enchanters found their bindings slipping; metals they had strengthened with ancient rites turned brittle. The forge cracked with panic; the spell faded before the heat cooled. From that day on, no enchantment held for the ages—unless by some rare and terrible force."
     },
     {
          "year": "-1700",
          "title": "The Great Draconic slumber",
          "details": "Dragons, both great and small, across Skazka sought out places of safety and began an almost synchronised slumber. It is as though they could sense something and that hibernation was a natural defence that kicked in."
     },
     {
          "year": "-1650",
          "title": "Ku'Than rises",
          "details": "Nobody outside of Ku'Than knows how it all came about, but it is said that, virtually over night, this forest became the domain of the goddess, Than."
     },
     {
          "year": "-1300",
          "title": "The Gods abandon the Giants of Skia",
          "details": "The Giants, said to be the off-spring of Gods and humans, withdraw to their ice castles; infighting ravages their society. It is said they have been cursed by the Gods for some transgression. The humans of Skia are left to fend for themselves.",
          "expanded_html": true,
          "expanded": "The giants are said to be the result of mating between the Gods and human females. Tall, strong and commanding. Yet they reamin unhappy with their lot; it is said the Gods tasked them with keeping humans in check. But some among the giants took this a step further and enslaved them. Little is remembered of this time, but it is said the Giants had their human slaves mining; not for coal or gold, but for a mysterious relic.<br><br>A series of harsh winters and disease outbreaks erupts into civil war among the giants and they lose control of the human population. Open rebellion begins and the Giants retreat north to their castles made of ice and stone, believing they have been cursed by the Gods. The humans of Skia must learn to carve their own path.<br><br>They head south to warmer climate and setup small farming communities. Away from the whip of their masters, humans learn fast and adapt even faster. "
     },
     {
          "year": "-1200",
          "title": "The Trial of Ashen Bride",
          "details": "A young witch fails the rite of survival in Ku’Than. Rather than die, she becomes a wraith bound to the Elden Wood, cursed to whisper riddles to children."
     },
     {
          "year": "-421",
          "title": "Exodus",
          "details": "Humans traverse the great ocean between Skia and Kelos and settle on Snuuflund.",
          "expanded_html": true,
          "expanded": "Oral history is only ever as accurate as the willingness of those to remember factually. In this regard it is unclear why humans left Skia, an apparent paradise. Some historians go so far as to suggest that the oral traditions of the Sken are selective at best. At worst, willfuly untruthful. It is clear that the Sken did not leave Skia by choice. They fled. But from what? That is where the gaping hole in their history lies. There are no written records from this time to clarify the events which led to Exodus and their oral history is glaringly absent of detail. Folk legend suggests they awoke something deep in the mines they worked for their Giant masters and that the true reason the Giants fled north was to escape what was awoken. Whatever it was, it was terrible enough for an entire speciies to flee their home across a dangerous and vast ocean."
     },
     {
          "year": "-403",
          "title": "The decline of Kaijistan",
          "details": "The decline of this once magnificent Kingdom has begun. Within a single lifespan the kingdom will be no more and the sands will have engulfed all that was once great."
     },
     {
          "year": "-370",
          "title": "The Sandsea of Zhal’Shaar",
          "details": "he Sandsea of Zhal’Shaar appear in the southern Ahmaq Desert. Vast roiling sandstorms which cross the entire south from coast to mountain. It will tear the rigging from any ship that gets too close and flay the flesh of a living man."
     },
     {
          "year": "-320",
          "title": "Eastward",
          "details": "The human settlers of Snuuflund have outgrown the Serydina Isles.  Raiding parties set off east to the mainland of Kelos in search of new homes. One settles on the west coast. The other travels far to the east; they will eventually become the people of Caratania"
     },
     {
          "year": "-307",
          "title": "Caratania founded",
          "details": "The first small settlements grow to be towns and unite under a single banner of Hrothgar the merciless. This move is largely driven by the need to organise militia against the hordes of undead that come down from the mountains."
     },
     {
          "year": "-306",
          "title": "Heir no more",
          "details": "First born of Hrothgar Bloodlance is seduced by Kaelthir Duskbane, a vampire lord, and turned into a Thrall. Hrothgar vows to exterminate the vampire lords."
     },
     {
          "year": "0",
          "title": "Starfall",
          "details": "Kelos is struck by a devastating meteor shower. The impact iniates a cataclysmic event that begins a mini ice age. Priests and others who rely on their deities as the source of their magic report a dimming of their divine connection. The Walking Gods, or Prir, are not seen on Skazka from this point onwards.",
          "epoch": true
     },
     {
          "year": "2",
          "title": "There be dragons",
          "details": "Dragons that have slumbered for an eon under the northern ice are awoken."
     },
     {
          "year": "5",
          "title": "Shattered Hosts",
          "details": "After Starfall, Aeternian legions sent north vanish in blizzards of glass-ice. Their frozen standards still glitter beneath the wastes to this day."
     },

     {
          "year": "12 - 27",
          "title": "Construction of citadel Grimspire",
          "details": "Construction of citadel Grimspire is undertaken with the help of Icethorn, the ancient white dragon."
     },
     {
          "year": "111",
          "title": "Order of the Word founded",
          "details": "The Sun Elves agree to teach Humans magic and the Order of The Word is formed."
     },
     {
          "year": "134",
          "title": "The Purge of the White Sepulchre",
          "details": "Fanatics of Aeter burn a sect of necromancers in the ruins of the White Sepulchre. Survivors scatter, carrying forbidden texts that will resurface centuries later. "
     },
     {
          "year": "135",
          "title": "The Shield of Dawn formed",
          "details": "Those who took part in the massacre at the White Sepulchre band to form The Shield of Dawn, a sect of Aeter devoted to hunting undead.. "
     },
     {
          "year": "192",
          "title": "Fall of Grimspire",
          "details": "Grimspire meets a tragic end. Encouraged by the Fire Witch Maldrath, a group of hunters attack Icethorn's mate, destroying her unhatched eggs. The ancient beast takes her revenge: she attacks Grimspire freezing the citadel, making it uninhabitable, even today."
     },
     {
          "year": "197",
          "title": "Expedition Oy",
          "details": "The renowned explorer and historian, Matildas, convinced he knows the location of the mythical isle of Oy, sets of in three ships. He is never seen again.."
     },
     {
          "year": "312",
          "title": "The Frozen pilgrimage",
          "details": "Hundreds of peasants march north in desperation after it is rumoured a bright magical light was spotted in the skies above the glaciers. No trace of them is ever found."
     },
     {
          "year": "695 - 701",
          "title": "The Shadow War",
          "epoch": true,
          "details": "Civil war within the Order of the Word escalates widely and becomes The Shadow War. The Order is split into two factions: one lead by Ilistran Darkweaver who believes magic should be used to elevate mages to a status above mortals; the other led by Arica Dreamforger, believe magic should be used to help all people. The war ends with Ilistran's defeat and disappearance."
     },
     {
          "year": "696",
          "title": "Battle of the Dunes",
          "details": "The first major confrontation between the two warring factions within the Order of the Word.",
          "expanded_html": true,
          "expanded": "With the forces of both <strong>Ilistran Darkweaver</strong> and <strong>Arica Dreamforger</strong> searching for the same relic, a confrontation was inevitable. This took place in the sands of the Ahmaq Desert when both sets of forces converged on a small oasis and suspected resting place of the relic. The magics unleashed here were so powerful that it turned the sand to glass. The relic was never found."
     },
     {
          "year": "700",
          "title": "Nav'golam sealed",
          "details": "King Theldon orders Nav'golam to be sealed shut to protect his kingdom from the Shadow War."
     },
     {
          "year": "701 - 951",
          "title": "Magical Prohibition",
          "details": "Despite the end of the Shadow War, the continued incursions from other dimensions forces the Aeternian Empire to ban the use of magic by anyone other than those approved to do so by the Emperor. This continued for more than two centuries. To this day the use of displacement and dimensional magic is still banned within Aeternia and viewed with grave suspicion elsewhere."
     },
     {
          "year": "801",
          "title": "Nav'golam opens its doors once more",
          "details": "The Kingdom is open once again to trade and visitors. It is said that King Theldon's self imposed isolation drove him mad."
     },
     {
          "year": "950",
          "title": "Rise of the Black Oak cult",
          "details": "The Black Oak cult launches attacks against the Kingdom of Ku'Than then retreats to the Weird Wood. The implant living thorns into the skulls of captives who transform into hybrid creatures made of flesh and wood."
     },
     {
          "year": "955",
          "title": "The Weeping Plague",
          "details": "A sickness spreads across Kelos: the infected weep blood before falling into comas. Survivors claim to dream of Fafnirog, begging to be reborn. The plague burns itself out, but leaves dread lingering in ports."
     },
     {
          "year": "971",
          "title": "Current year",
          "details": "This is the year the campaign starts."
     }
]
